[
    {
        "id": "3e378b91-7cc0-486e-b18d-518ab29569e3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3e378b91-7cc0-486e-b18d-518ab29569e3",
        "created_at": "Wed Sep 11 18:59:59 UTC 2019",
        "company": "Simon & Schuster ",
        "company_url": "https://www.simonandschuster.com/",
        "location": "New York, NY",
        "title": "Lead Software Engineer",
        "description": "<p>Simon &amp; Schuster is seeking a Lead Software Engineer to join a rapidly growing team focused on impacting the world of publishing through research and innovation. Working with a team of data scientists, data engineers, designers, and domain experts, you will be involved in rapidly prototyping, developing, and deploying the platforms that put insights and information into the hands of decision-makers.</p>\n<p>From databases to serverless applications, you will be designing, deploying , and managing the systems that connect our real-world data to the books and authors that inform and entertain our world. As a Full Stack (Engineer|Developer) you will engage with engineers and domain experts across the organization, collaborating to design and deploy innovative new products and services. From inception to production, you will onboard, integrate and deploy an array of cutting-edge tools and technologies to seamlessly deliver our solutions.</p>\n<p>Publishing experience is not required. Instead we are seeking teammates with curiosity, problem-solving skills, and a thirst for knowledge.</p>\n<p>Responsibilities:</p>\n<p>●     Scale team success from prototype to production.\n●     Own the software engineering aspects of our data services and applications.\n●     Design, build, test, and deploy solutions serving the entire organization.\n●     Be the “go to” engineer for our products and services.\n●     Tailor and drive the creation and adoption of best practices for software engineering for our team and peer engineering teams across the organization.\n●     Work with users, designers, developers, and analysts to ensure requirements-driven engineering in all we do.\n●     Ensure high availability and security are maintained in the products and services delivered by our team.</p>\n<p>Qualifications:\n●     5+ years experience in web application development and managing deployments\n●      Experience with full-stack development: Front-end, web servers, databases and storage.\n●      Deep understanding of modern software development practices (CI/CD, Continuous Monitoring, Testing, Documentation)\n●     Experience in production commercial with architecting and managing cloud deployments (GCP, AWS, Azure, etc.)\n●     Proficiency with Linux, SQL, Python, and Javascript required\n●     Solid background working with large-scale and fast-moving data technologies (Streaming, NoSQL, Object-stores, etc.)\n●     Familiarity with common build systems, Github/Gitlab, Confluence, JIRA\n●     Ability to work effectively in teams of technical and non-technical people.\n●     Ability to work independently and effectively\n●     Desire to research and communicate requirements and solutions.</p>\n",
        "how_to_apply": "<p>Apply Online: <a href=\"https://cbs.avature.net/cbssscareers/JobDetail/Lead-Software-Engineer/14487\">https://cbs.avature.net/cbssscareers/JobDetail/Lead-Software-Engineer/14487</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDF4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--acf24dd4bdd4f94a7d7a2dfc717ef5415bad86ce/43811-1.jpg"
    },
    {
        "id": "e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "created_at": "Mon Sep 09 15:29:25 UTC 2019",
        "company": "Noe & Associates",
        "company_url": "http://http",
        "location": "New York, NY",
        "title": "Web Developer",
        "description": "<p>A leading international branding and design consultancy is seeking a seasoned Web Developer who will be responsible for coding innovative websites for world renowned premium brand, real estate, hospitality, architecture and design clients.</p>\n<p>The Web Developer will be proficient in building and maintaining small to medium size websites in a fast paced environment. Experienced in working with a team of designers and shipping code as an individual contributor within the team. Individual will care about writing elegant code and look for opportunities to build user-friendly websites that fulfill the goals of an identity system.</p>\n<p>Ideal candidate will have a strong interest in design, or a desire to work closely with designers during the design phase of the project. You’ll learn about the details that make the brand identity work well on multiple levels, and eventually help guide the website design along interesting pathways based on technical opportunities and limitations.</p>\n<p>Responsibilities will include:</p>\n<p>▪\tWebsite and software application designing, building and maintenance, including integration    with third party API.</p>\n<p>▪\tUsing scripting or authoring languages, management tools, content creation tools, applications and digital media.</p>\n<p>▪\tConferring with clients and teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions.</p>\n<p>▪\tPerforming Website updates as required.</p>\n<p>▪\tDeveloping or validating test routines and schedules to ensure that test cases mimic external interfaces and address all browser and device types.</p>\n<p>▪\tMaintaining an understanding of the latest Web applications and programming practices.</p>\n<p>▪\tIdentifying problems uncovered by client feedback and testing, and correcting problems.</p>\n<p>▪\tEvaluating code to ensure it meets industry standards, is valid, is properly structured, and is compatible with browsers, devices and operating systems.</p>\n<p>Candidate should possess following skills:</p>\n<p>▪\tBachelor degree in Computer Science or related field, or relevant experience.</p>\n<p>▪\tSolid knowledge and experience in programming applications.</p>\n<p>▪\tProficient in JavaScript, HTML, HTML5, CSS3.</p>\n<p>▪\tDeep knowledge of Ruby on Rails and comfortable with Postgres and Sass.</p>\n<p>▪\tFamiliarity with version control, ideally Git and a GitHub-based workflow.</p>\n<p>▪\tProficient in back-end development and maintenance on Heroku, AWS &amp; Linode services. Also, familiarity with virtual private servers (VPS) and Linux environment.</p>\n<p>▪\tSelf-starter with strong communication and interpersonal skills.  Organized, reliable, with the ability to multi-task and manage multiple deliverables/projects.</p>\n<p>▪\tFamiliarity with PHP based frameworks, such as WordPress or Drupal or prior experience in e-commerce platforms such as Magento are a plus.</p>\n",
        "how_to_apply": "<p>If interested, please email resume, portfolio and cover note to <a href=\"mailto:careers@noeassociates.com\">careers@noeassociates.com</a></p>\n",
        "company_logo": null
    },
    {
        "id": "9ecfe037-40c7-4f69-b447-385eab05bd03",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9ecfe037-40c7-4f69-b447-385eab05bd03",
        "created_at": "Mon Sep 02 17:22:58 UTC 2019",
        "company": "CreditZO",
        "company_url": "https://creditzo.com",
        "location": "New York, NY",
        "title": "Lead Engineer & CTO",
        "description": "<p>​<strong>Have you always wanted to work in a dynamic, fast moving startup?</strong>\n\n<strong>We are CreditZO, an exciting start up that aims to disrupt the credit restoration industry.</strong></p>\n\n<p><strong>All about CreditZO:</strong></p>\n<p>We are a growing team of talented Marketers and Engineers whose <em>mission is to develop a fully automated credit restoration solution.</em> All of us are entrepreneurs at heart, seeking to move quickly and nimbly in order to find new ways of delivering value to our customers. We strive on finding solutions to most complex problems and have a solid track record of creating and scaling multiple successful start-up ventures.</p>\n<p>You will be joining at a very exciting time as we have recently launched our fully automated consumer product after 15 months of development. We are planning on scaling up rapidly and are looking for an ambitious, talented Sr. Engineer to take on the role of company CTO. Our tech stack features the latest technology in a cloud environment. The position is challenging and stimulating and is in a fast-paced results oriented company. The business is post MVP and has a product on the market (alleviating a lot of start up risks).</p>\n<p><a href=\"https://creditzo.com/\">CreditZO</a></p>\n<p><strong>What you will get to do:</strong></p>\n<ul>\n<li>Run day to day operations for in-house development and cloud based infrastructure.</li>\n<li>Build additional sophisticated features to add to our service</li>\n<li>Build, support and mentor effective teams</li>\n<li>Design and create services and system architecture for your projects, and contribute and provide feedback to other team member.</li>\n<li>Improve code quality through writing unit tests, automation and performing code review</li>\n<li>Participate in brainstorming sessions and contribute ideas to our technology and algorithms</li>\n<li>Work with the product manager to understand end-user requirements and then translate that into a pragmatic and effective technical solution.​</li>\n</ul>\n<p><strong>Required Technical Skills:</strong>\n<strong>6+ years hands-on development and delivery experience as a web based software developer.</strong></p>\n<p><strong>Significant experience with:</strong></p>\n<ul>\n<li>Development experience with Java or Kotlin on the JVM</li>\n<li>Experience with No-SQL (preferably MongoDB)</li>\n<li>Front end web development with Typescript or JavaScript</li>\n<li>Experience with cloud base infrastructure (preferably AWS)</li>\n<li>Work independently on projects able to execute to completion</li>\n<li>RabbitMQ or similar messaging-broker platform</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Angular 2-8</li>\n<li>AWS S3, CloudFront</li>\n<li>Experience in a startup or small dev shop</li>\n<li>Experience in e-commerce/public-facing web services</li>\n</ul>\n<p><strong>Other:</strong></p>\n<ul>\n<li>Experience with leading and inspiring software development teams</li>\n<li>Strong people skills that contribute to an open and collaborative environment</li>\n<li>Experience in communicating technical vision to a variety of team members</li>\n</ul>\n",
        "how_to_apply": "<p>Email your Resume to:\n<a href=\"mailto:recruit@creditzo.com\">recruit@creditzo.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXB3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--045c6faf5fcdbb1d2b1a670f9f3e5d71d5fdb5e5/logo-creditzo.jpg"
    },
    {
        "id": "6cc20231-5834-4766-98c7-7a5daac8e50d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6cc20231-5834-4766-98c7-7a5daac8e50d",
        "created_at": "Thu Aug 29 21:44:11 UTC 2019",
        "company": "Kettle",
        "company_url": "https://wearekettle.com/",
        "location": "New York, NY",
        "title": "Senior Back-End Web Developer",
        "description": "<p>Your task.</p>\n<p>We're looking for a full-time Back-end Web Developer (Ruby, Python, or PHP). At Kettle, you'll be building  web applications—everything from interactive experiences to complete websites—for clients ranging from Fortune 100 companies to budding start-ups. We're looking for a versatile developer comfortable with the model-view-controller pattern and flexible enough to work with a variety of modern Web frameworks. You'll be working hand-in-hand with our front-end developers to construct the site's functionality.</p>\n<p>We’d like to know that you can:</p>\n<p>Build complex, dynamic web applications from prototyping to deployment using modern MVC frameworks and design patterns\n4+ years experience in PHP, Python, or Ruby\nEfficiently integrate and debug third-party APIs\nBasic Linux system skills and AWS console experience\nWorking knowledge of Docker containers, virtual machines, and automated provisioning\nHTML, CSS, and JavaScript fundamentals</p>\n<p>The right candidate should also have:</p>\n<p>An insatiable curiosity for new techniques and a razor-sharp eye for detail\nA love for programming and eagerness to tackle unique, challenging problems\nYou’re serious about your work, but don’t take yourself too seriously\nA passion for collaborating with a creative team to build great products</p>\n<p>Why it’s an awesome gig:</p>\n<p>Direct new web projects from scratch. As the lead back-end developer, you will be entrusted with a wide range of responsibilities and be able to rapidly iterate, collaborate, and learn from a large, multidisciplinary team.\nChoose and use the best tools. Build projects using modern packages, services, and frameworks. You will be given wide autonomy to choose the right tools for the problem.\nTouch many different clients across industries and needs. Our projects aren’t “one size fits all.” This will let you experiment with new ways of thinking and working to build amazing products.</p>\n<p>A little about us:</p>\n<p>An independent digital agency with offices in New York City and San Francisco. We’re a team of makers, doers, and passionate problem-solvers with a simple mission: to make tomorrow better. We spend countless hours tinkering and asking questions until we unequivocally know the product is in its purest, most elegant form. Our strengths are creating user-centric products, keeping it simple, and telling great stories. Our weaknesses are baked goods, french fries, and karaoke.</p>\n<p>More info:</p>\n<p>Candidate must be a US citizen or have a work permit.\nCompetitive compensation based on experience.\nAll candidates should submit code samples or links to demonstrate your abilities</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:lauren.marusich@wearekettle.com\">lauren.marusich@wearekettle.com</a> and <a href=\"mailto:kacey.aumack@wearekettle.com\">kacey.aumack@wearekettle.com</a> along with code samples or links to demonstrate your abilities in this role</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGx3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d88bebe6435d2410432801a554467c5092ed1d11/Kettle%20Logo.png"
    },
    {
        "id": "d4b0b800-1adc-4c9f-900b-8d43fd4d44aa",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d4b0b800-1adc-4c9f-900b-8d43fd4d44aa",
        "created_at": "Thu Aug 29 21:36:15 UTC 2019",
        "company": "Kettle",
        "company_url": "https://wearekettle.com/",
        "location": "New York or anywhere in the US",
        "title": "Senior Front-end Web Developer",
        "description": "<p>Your task.</p>\n<p>Kettle is seeking a front-end developer with a passion for solving problems and making creative concepts a reality through clean, maintainable code. The first client you’d be working alongside has been celebrated for its iconic design and groundbreaking engineering. And in the dev community they’re known for a meticulous approach to code that’s so pure, it’s considered an art in and of itself.</p>\n<p>We’d like to know that you can:</p>\n<p>5+ years experience in front-end web development\nComprehensive knowledge of HTML, CSS, and JavaScript\nA track record of building component-based SPAs using React\nExcellent verbal/written communication and time management skills\nProven debugging and troubleshooting skills\nFamiliarity with a variety of front end tooling systems</p>\n<p>The right candidate should also have:</p>\n<p>An insatiable curiosity for new techniques and a razor-sharp eye for detail\nA love for programming from scratch with object-oriented JavaScript (DOM literacy is a must!)\nYou’re serious about your work, but don’t take yourself too seriously\nA passion for collaborating with a creative team to build great products</p>\n<p>Why it’s an awesome gig:</p>\n<p>Build next-gen web applications in JavaScript. Help elevate JavaScript to the level of its more respected brethren through unit tests, headless testing, and by contributing to core libraries authored and maintained by many of the world's best engineers.\nChoose and use the best tools. Build greenfield projects using the most modern and suitable packages, services, and frameworks. Your first project will be in React and Redux.\nLead the charge in accessibility. Be on the forefront of implementing truly accessible content at scale. And with this client, ‘at scale’ means really, really big.\nCraft pixel-perfect, butter-smooth animations. Leverage the team's shared knowledge to exploit all the quirks of modern browsers for animations that perform consistently and beautifully.</p>\n<p>More info:</p>\n<p>Candidate must be a US citizen or have a work permit.\nCompetitive compensation based on experience.\nAll candidates should submit code samples or links to demonstrate your abilities; a GitHub, Bitbucket account, or a Stack Overflow profile is sufficient.</p>\n",
        "how_to_apply": "<p>Please email your resume to <a href=\"mailto:lauren.marusich@wearekettle.com\">lauren.marusich@wearekettle.com</a> along with code samples or links to demonstrate your abilities. A GitHub, Bitbucket account, or a Stack Overflow profile is sufficient.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGR3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--efe7363292fb1ff0b3cbde60da6febdddcb1cf68/Kettle%20Logo.png"
    },
    {
        "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "created_at": "Mon Nov 19 19:40:01 UTC 2018",
        "company": "Prosek Partners",
        "company_url": "https://www.prosek.com",
        "location": "Fairfield, CT",
        "title": "Front End Developer",
        "description": "<p>Background</p>\n<p>Prosek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.</p>\n<p>The Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.</p>\n<p>Technical skills:</p>\n<ul>\n<li>Design overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications</li>\n<li>Understanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design</li>\n<li>Understanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms</li>\n<li>Delivering reusable components, code and front-end libraries for future use</li>\n<li>Translating designs and wireframes into high quality, tested code</li>\n<li>Experience with interactive web elements and motion</li>\n<li>Able to identify opportunities for process and tool improvements</li>\n<li>Proficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM</li>\n<li>Understanding of CSS pre- and post-processors</li>\n<li>Experience working with third party services, APIs, and content management systems.</li>\n<li>Proficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign</li>\n<li>Comprehensive awareness and interest in new technologies</li>\n<li>Understanding of full-stack requirements and deployments</li>\n<li>Enforce front-end code compliance with web for cross-browser and platform compatibility</li>\n</ul>\n<p>As a Front End Developer, you will be expected to:</p>\n<ul>\n<li>Be self-motivated, detail-oriented and confident</li>\n<li>Capable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements</li>\n<li>Translate ideas, end-user needs, design criteria, and technical features into quality web productions</li>\n<li>Present and defend technical recommendations to the team</li>\n<li>Able to speak not just passionately about your work but also plainly to those who are inexperienced</li>\n<li>Have a strong grasp of storytelling through layout and information design</li>\n<li>Possess excellent written and verbal communication skills</li>\n<li>Be comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers</li>\n<li>Able to work under tight deadlines, with little supervision</li>\n<li>Rise above the competition: tell us about your experience with mobile app development</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Bachelor's degree in computer science or related field</li>\n<li>3-5 years of professional IT-related experience</li>\n<li>Demonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends</li>\n<li>Fluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:developerjobs@prosek.com\">developerjobs@prosek.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"
    },
    {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
    },
    {
        "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "created_at": "Wed Nov 14 22:16:02 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Lead Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer with proven leadership and management experience.</p>\n<p>You are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.</p>\n<p>Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities</strong>:</p>\n<ul>\n<li>Provide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews</li>\n<li>Help plan and execute team and individual goals, with an eye on team growth and development</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability</li>\n<li>Act as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features</li>\n<li>Act as a expert who can provide technical help and guidance to the other front end developers</li>\n</ul>\n<p><strong>Requirements</strong>:</p>\n<ul>\n<li>Proven experience with technical leadership and management</li>\n<li>Experience architecting a front end codebase at scale</li>\n<li>Strong technical and non-technical communication skills</li>\n<li>Able to look at a design and break it into well organized reusable components</li>\n<li>Experience planning, ticketing, and executing team projects</li>\n<li>Comfortable with Git for version control</li>\n<li>Effective time management when working on multiple projects</li>\n<li>Passionate about front end performance with up-to-date knowledge of current techniques</li>\n<li>Familiar with Node.js and modern frontend build tooling</li>\n<li>Knowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS</li>\n<li>Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values</strong>:</p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability</em>.</p>\n<p><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
    },
    {
        "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "created_at": "Wed Nov 14 22:11:05 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Senior Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer and solid communicator with an interest in journalism and the media business.</p>\n<p>You’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities:</strong></p>\n<ul>\n<li>Implement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary</li>\n<li>Mentor junior developers and act as a subject expert</li>\n<li>Thinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability</li>\n<li>Work to continually reduce our front end website load time</li>\n<li>Communicate and collaborate with both technical and non-technical members of the team</li>\n</ul>\n<p><strong>Requirements:</strong>\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website</p>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values:</strong></p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability.</em></p>\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
    },
    {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
    },
    {
        "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977",
        "created_at": "Tue Nov 06 20:25:06 UTC 2018",
        "company": "Constructive",
        "company_url": "http://constructive.co",
        "location": "New York, New York",
        "title": "Sr. Web Developer (Full-Stack/WP), Social Change Design Agency",
        "description": "<p><strong>Sr. Web Developer (Full-Stack/WP), Digital Agency for Social Change</strong></p>\n<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.</p>\n<p>If you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p><strong>A bit about the role</strong></p>\n<p>Sr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.</p>\n<p><strong>A bit about us</strong></p>\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.</p>\n<p><strong>A bit about diversity</strong></p>\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.</p>\n<p><strong>What we need you to do extremely well</strong></p>\n<p>We’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.</p>\n<ul>\n<li>Understand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.</li>\n<li>Collaborate across teams to plan and execute ambitious digital projects.</li>\n<li>Develop backend and frontend, taking ownership of your projects from start to finish.</li>\n<li>Participate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.</li>\n<li>Document your work to make it easier for other developers, both now and in the future, to work with what you’ve built.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.</li>\n<li>Contribute to ongoing development and support for existing websites.</li>\n<li>Contribute to developing proposals and estimates for projects you will be a lead developer.</li>\n<li>Be a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li>Have a sense of humor. Seriously, life can be stressful enough these days.</li>\n</ul>\n<p><strong>Expertise that’s important in our work</strong></p>\n<p>Right now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.</p>\n<ul>\n<li>Expert-level Wordpress Development (Min 3 years experience)</li>\n<li>Expert CSS chops (and SCSS!)</li>\n<li>Strong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)</li>\n<li>Strong preprocessor experience (Webpack / Gulp)</li>\n<li>Strong Git experience</li>\n<li>Experience with MySQL</li>\n<li>Experience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)</li>\n<li>Comfortable with D3</li>\n<li>Comfortable with AWS</li>\n<li>Comfortable with Server Administration &amp; DevOps</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:</p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<ul>\n<li>Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16 days)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place.</li>\n</ul>\n<p><strong>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "how_to_apply": "<p>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</p>\n",
        "company_logo": null
    },
    {
        "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45",
        "created_at": "Thu Nov 01 13:09:37 UTC 2018",
        "company": "Jane Street",
        "company_url": "http://janestreet.com",
        "location": "New York, NY; London, UK; Hong Kong",
        "title": "Software Developer (Functional Programming)",
        "description": "<p>Software Developer</p>\n<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p>\n<p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p>\n<p>We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.</p>\n<p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.</p>\n<p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href=\"http://ocaml.janestreet.com/?q=node/61\">http://ocaml.janestreet.com/?q=node/61</a>), and our programming blog (<a href=\"http://ocaml.janestreet.com\">http://ocaml.janestreet.com</a>).</p>\n<p>We also have extensive benefits, including:</p>\n<ul>\n<li>90% book reimbursement for work-related books</li>\n<li>90% tuition reimbursement for continuing education</li>\n<li>Excellent, zero-premium medical and dental insurance</li>\n<li>Free lunch delivered daily from a selection of restaurants</li>\n<li>Catered breakfasts and fresh brewed Peet's coffee</li>\n<li>An on-site, private gym in New York with towel service</li>\n<li>Kitchens fully stocked with a variety of snack choices</li>\n<li>Full company 401(k) match up to 6% of salary, vests immediately</li>\n</ul>\n<p>More information at <a href=\"http://janestreet.com/culture/benefits/\">http://janestreet.com/culture/benefits/</a></p>\n",
        "how_to_apply": "<p>Please apply through our web app form at  <a href=\"https://www.janestreet.com/join-jane-street/apply/\">https://www.janestreet.com/join-jane-street/apply/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6dec9502d27094bbc9c7ff6c33806d0cdbb6faf/ac79023f-6a10-488b-be9f-751264dd8d06"
    },
    {
        "id": "df5b47be-d612-11e8-88f4-50633736745c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/df5b47be-d612-11e8-88f4-50633736745c",
        "created_at": "Mon Oct 22 15:56:13 UTC 2018",
        "company": "Constructive",
        "company_url": "http://www.constructive.co",
        "location": "New York City",
        "title": "Technology Team Lead, Design Agency for Social Impact",
        "description": "<p>Constructive (<a href=\"https://constructive.co\">https://constructive.co</a>), a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.</p>\n<p>If you’re an experienced technologist who wants to work on websites and products that are at the front of the field, knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p>##A bit about the role\nOur Technology Team Lead needs a holistic understanding of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.</p>\n<p>That’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.</p>\n<p>##A bit about us\nWe’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office, so there’s music and joking mixed-in with being heads-down on work.</p>\n<p>##A bit about diversity\nWe believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.</p>\n<p>##What we need you to do extremely well\nThis role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well.</p>\n<ul>\n<li>\n<strong>Provide strong technical leadership</strong>—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.</li>\n<li>\n<strong>Guide development team</strong> and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meets expectations.</li>\n<li>\n<strong>Work with stakeholders to define strategic goals</strong> and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.</li>\n<li>\n<strong>Develop requirements, specifications, and architecture</strong> to document what we’re building and what’s been built.</li>\n<li>\n<strong>Lead development of ambitious digital products,</strong> serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.</li>\n<li>\n<strong>Be a hands-on developer</strong> who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed.</li>\n<li>\n<strong>Review code and provide feedback</strong> on work done by other developers; oversee the UAT and QA processes in coordination with project managers.</li>\n<li>\n<strong>Improve best practices, recommend tools, and build frameworks</strong> that make our work more efficient, effective, and technically front-of field.</li>\n<li>\n<strong>Be the face of Constructive’s technical expertise</strong> throughout client engagements, in the development community, and when needed in our sales cycle.</li>\n<li>\n<strong>Contribute to developing proposals and estimates</strong> for technical projects, particularly those with complex requirements.</li>\n<li>\n<strong>Lead vetting and hiring of web developers</strong> and external development partners.</li>\n<li>\n<strong>Be a team player</strong> who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li><strong>It definitely helps if you also have a good sense of humor</strong></li>\n</ul>\n<p>##Expertise that’s important in our work\nRight now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.</p>\n<ul>\n<li>Expert Wordpress &amp; Drupal development (Minimum 5 years of experience)</li>\n<li>Expert front-end development experience</li>\n<li>Strong experience with Webpack / Gulp / SCSS</li>\n<li>Strong experience doing large-scale content migrations</li>\n<li>Strong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)</li>\n<li>Experience with Data Visualization (D3, Highcharts)</li>\n<li>Experience with Infrastructure, System Administration &amp; DevOps</li>\n<li>Experience with ES6, Node, React</li>\n</ul>\n<p>##What’s in it for you?\nWork/Life balance matters at Constructive, and we do our best to make sure everyone is well-taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Added to your base salary, here’s what we have on tap for 2018-2019 to add:</p>\n<p>##Benefits &amp; Perks</p>\n<ul>\n<li>Company-Sponsored Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus (Approx 10% of company profit distributed equally)</li>\n<li>Discretionary performance-based bonuses</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year’s</li>\n<li>1/2-day Summer Fridays (Approx 16)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly &amp; Annual employee-voted \"shout-out\" gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place</li>\n</ul>\n",
        "how_to_apply": "<p><strong>Interested? Great! Then please send an email to titled “Technology Team Lead” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>• A resume</li>\n<li>• A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>• Links to your own website, websites you’ve worked on, github, whatever</li>\n<li>• Desired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3235bba838d5ca1495e8b2f6b73a0e54ee613498/caadf965-8957-438b-b2f8-12af175c8721"
    },
    {
        "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "created_at": "Fri Nov 02 19:02:51 UTC 2018",
        "company": "Jun Group",
        "company_url": "https://www.jungroup.com/",
        "location": "New York, NY",
        "title": "Senior Software Developer, Server-Side Technologies",
        "description": "<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events</li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/06736d9f2\">https://grnh.se/06736d9f2</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"
    },
    {
        "id": "cfc11293-327f-4e71-9c84-58c273d9911c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cfc11293-327f-4e71-9c84-58c273d9911c",
        "created_at": "Thu Sep 19 14:24:59 UTC 2019",
        "company": "TrialSpark",
        "company_url": "http://www.trialspark.com",
        "location": "New York",
        "title": "Senior Software Engineer - Product",
        "description": "<p><strong>Background</strong></p>\n<p>Before new medical treatments can be administered to the public, they must demonstrate safety and efficacy in a clinical trial. These trials protect consumers from ineffective and dangerous products, but the clinical trial process also presents a tremendous bottleneck in delivering life-saving treatments to patients.</p>\n<p>A typical trial involves coordinating between numerous parties and data formats to gather, store, analyse, and audit clinical data. Mistakes and delays are common, and fewer than 10% of trials finish on time. At TrialSpark, we are reimagining the clinical trial process from first principles, and building the technology platform for the trial of the future.</p>\n<p>So far, we’ve worked with treatments for Ebola, Depression, and HIV. Our reach is growing rapidly, and building a world class engineering team is core to achieving our mission.</p>\n<p><strong>Job Description</strong></p>\n<p>As a Senior Software Engineer, you will be responsible for designing, building, testing, securing, deploying, maintaining, and improving software applications for use both by internal TrialSpark employees and for external users. You will work with product managers, designers, and other functions of the business to help set priorities, scope technical work, coordinate changes, clarify and refine requirements, and set appropriate expectations. You are autonomous and self-driven, but can work effectively in a highly collaborative and team setting.</p>\n<p>Duties include but are not limited to:</p>\n<ul>\n<li>Design, develop, test, and deploy software for TrialSpark’s proprietary applications.</li>\n<li>Communicate with product management and operational stakeholders to determine requirements.</li>\n<li>Iterate and refine software development processes and best practices for software development, with the aim of producing high-quality and validated software.</li>\n<li>Address any bugs and errors in TrialSpark software applications in a timely way.</li>\n</ul>\n<p><strong>Relevant Experience</strong></p>\n<ul>\n<li>Minimum 4 years of experience in an agile software development environment.</li>\n<li>Knowledge of Python, TypeScript, JavaScript, SQL, database design.</li>\n<li>Familiarity with Linux-based operating systems, cloud technologies (AWS, Docker), and PostgreSQL database.</li>\n<li>Experience with debuggers, e.g. browser debuggers, pdb, PyCharm, etc.</li>\n<li>Strong technical understanding of web-based technologies.</li>\n<li>Exceptional communication skills with the ability to convey complicated systems to both technical and non-technical audiences.</li>\n<li>Proven track record of working with product management and shipping features to end users in a team environment.</li>\n<li>B.A./B.S. in Computer Science or a related field, or equivalent experience</li>\n</ul>\n<p><strong>Bonus points</strong></p>\n<p>If you’ve worked with React, Python, Redux, Flask, and SQLAlchemy</p>\n<p>You will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n",
        "how_to_apply": "<p>To apply - visit this <a href=\"https://grnh.se/50044ba41\">link</a>!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzF5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--51958ea89bb6c1dcc18bd3c403035172ec159fe7/_ts-black_wordmark.png"
    },
    {
        "id": "e3268c79-614c-4978-8f22-e6495c1e067f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e3268c79-614c-4978-8f22-e6495c1e067f",
        "created_at": "Wed Sep 04 19:54:29 UTC 2019",
        "company": "Stride Consulting",
        "company_url": "https://www.stridenyc.com/careers",
        "location": "New York City",
        "title": "Lead Software Development Consultant",
        "description": "<p><strong>Join our Family</strong></p>\n<p>Stride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’re in great company.</p>\n<p>Our goal is to leave our clients functioning at a higher level than when we found them.  We do this by writing high quality code alongside them, and by mentoring their developers, product teams and stakeholders in software development best practices.</p>\n<p>We believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.</p>\n<p><strong>As a Strider, you’ll find an unmatched opportunity. You will:</strong></p>\n<p>Be a senior member of an engineering-driven culture, one that is employee owned, has a 4.9 star Glassdoor review, and has won Crain’s Best Places to Work 2 years in a row.\nWrite high-quality code with some of the smartest engineers in town.\nMentor and manage a Stride team\nManage projects:\nCreate technical engagement strategy with Stride’s account team\nForm trust with client leadership\nHelp structure how the project is run, including Agile process and development/architecture decisions</p>\n<p><strong>Day In The Life of an Engineering Manager</strong></p>\n<p>You are empowered to define what work/life balance means to you. You’ll work onsite at your client in NYC. We are proud to call some of the most outstanding tech teams our clients.</p>\n<p>Your work week will involve 60%-80% client work (coding, managing a Stride team, and running the engagement). The rest of your time will be spent on strategic initiatives.</p>\n<p>A sample day:</p>\n<ul>\n<li>\n<p>9am: Weekly Sprint Planning.  Me and the client Product Owner co-run weekly sprint planning. We’ve got the meeting down to a nice rhythm. We walk away with a plan.</p>\n</li>\n<li>\n<p>10am: Daily Standup.</p>\n</li>\n<li>\n<p>10:10-12:30 Pair Programming. This morning, I’m pairing with another Strider, a mid-level engineer. She’s got strong fundamentals. We’re doing a deep dive into complex backend code. She’s driving, I’m asking questions when I see she gets stuck. She noticed inefficient code and we spent about 20 minutes refactoring.</p>\n</li>\n<li>\n<p>12:30-1:30 Lunch</p>\n</li>\n<li>\n<p>1:30-3:00 Pair Programming</p>\n</li>\n<li>\n<p>3:00-3:30 Mob programming  A team member gets stuck on a piece of code. I sit down with Jean and his pair. We call over 2 other developers and we mob program. We figure out a plan and everyone is excited about the collaboration.</p>\n</li>\n<li>\n<p>3:30-4:30 Mind Map Over the past two months, I’ve observed the team’s strengths and areas for improvement. Today, I’m leading a Mind Mapping session with the Striders. We visually organize areas for improvement. We prioritize each item by complexity and importance. Next Monday, I’m presenting this to the client CTO.</p>\n</li>\n<li>\n<p>4:30- 5: Code Review Today, one of the Striders was coding solo. So, I sit down and review her code.</p>\n</li>\n<li>\n<p>5-6: Stride U DevOps Jam Stride U is ongoing education for Striders by Striders. Seven of us are taking the DevOps Jam course now, it’s 1 hour weekly, for 8 weeks.  DevOps is something I’m dipping a toe in and having a safe space to learn real world stuff that I can bring back to my client is amazing.</p>\n</li>\n<li>\n<p>6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.</p>\n</li>\n</ul>\n<p><strong>About your job at Stride</strong></p>\n<p>Your job: write high quality code, and bring a ‘teach a team to fish’ mentality to your project. You will:</p>\n<ul>\n<li>Embed with tech teams in some of NYC’s most exciting startup, mid-market and enterprise companies to help them up their game and get stuff done.</li>\n<li>Mentor and manage both Strider and client teams on the value of software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement</li>\n<li>Be the reason your client teams are higher performing on your last day with them than they were on your first day.</li>\n<li>Lead and be part of a cross functional team of Striders and client employees.</li>\n<li>Work with, learn and teach others a variety of tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.</li>\n</ul>\n<p><strong>You’re a fit if you have:</strong></p>\n<ul>\n<li>6+ years of software development experience, including 1 year as a lead developer or manager</li>\n<li>Proficiency in multiple programming languages and ability to quickly gain proficiency in unfamiliar languages and frameworks</li>\n<li>Desire to guide team strategy</li>\n<li>Passion for seeing projects through from inception to deployment</li>\n<li>Experience teaching TDD, story estimation, test writing, and effective pair programming</li>\n</ul>\n<p><strong>What you can expect from us:</strong></p>\n<ul>\n<li>Continuous learning on things that you are passionate about</li>\n<li>Competitive Pay and Benefits (including Profit Sharing!)</li>\n<li>Empowerment to work at a self-defined sustainable pace</li>\n<li>Awesome culture</li>\n<li>No travel</li>\n<li>$2,000 and up to two weeks of your time for self-directed professional development</li>\n</ul>\n<p><strong>About Stride Consulting</strong></p>\n<p>Stride Consulting is NYC’s go-to Agile software development consultancy.</p>\n<p>Our mission: Teach the World to Stride! We believe that high functioning development teams give an organization a true competitive advantage. We help tech teams up their game, and become the highest functioning version of themselves in perpetuity.</p>\n<p>We do this by co-locating and literally coding side-by-side with our clients. We come to you. The love for technical mentorship weaves a thread through all that we do. We not only advocate for best practices in software development, we model the way. Our non-dogmatic Agile developers and product managers teach through doing, because we know that every tech team is unique in their challenges and opportunities.</p>\n<p>We are employee owned &amp; run, and profitable. This means we don’t have a board of directors to answer to or investors who need to make a return. We are in control of our growth and can do so at a pace that sustains our culture and  prioritizes the happiness of our employees.</p>\n",
        "how_to_apply": "<p>If interested, please visit the link below to apply: <a href=\"https://boards.greenhouse.io/stride/jobs/1342703\">https://boards.greenhouse.io/stride/jobs/1342703</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b05dfdb553ecacd9b3565dff9e5dbcefb66b4126/Stride%20Consulting%20Logo%20Below%202018.png"
    },
    {
        "id": "b825e6d6-59fa-4122-8e10-b252f79a35f0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b825e6d6-59fa-4122-8e10-b252f79a35f0",
        "created_at": "Fri Aug 23 13:45:42 UTC 2019",
        "company": "BITMARCK Service GmbH",
        "company_url": "http://www.bitmarck.de/karriere",
        "location": "Essen",
        "title": "Softwareentwickler (m/w/d) Business Intelligence und Data Warehouse",
        "description": "<p>Du suchst eine neue Herausforderung? Du brennst für Innovation und Digitalisierung? IT liegt dir im Blut? Dann bist du bei uns richtig! Wir suchen dich als</p>\n<h2><strong>Softwareentwickler (m/w/d) BI DWH</strong></h2>\n<p><strong>bei der BITMARCK Service GmbH am Standort Essen</strong></p>\n<h2><strong>Das machst du bei uns:</strong></h2>\n<ul>\n<li>Du übernimmst die Entwicklung und den Test von Software-Bausteinen zum Datenmanagement des DWH, die Dokumentation von Anwendungen sowie die Erstellung von Reports.</li>\n<li>Du modellierst, realisierst und implementierst Software-Bausteine und -Funktionen in Business Intelligence (BI) und im zentralen DWH u. a. mittels SQL, Teradata-Tools, Linux-Shell, C, Python und IBM Cognos.</li>\n<li>Du übersetzt fachliche Anforderungen in ein technisches Design-Modell als Grundlage für die Realisierung sowie Abschätzung von Aufwänden und der Realisierbarkeit von Softwareanforderungen.</li>\n<li>Du unterstützt und wirkst mit im Betrieb des zentralen DWH bzw. in agilen Projekten.</li>\n</ul>\n<h2><strong>Das bringst du mit:</strong></h2>\n<ul>\n<li>Eine Ausbildung zum Fachinformatiker (m/w/d) Anwendungsentwicklung oder ein Studium der (Wirtschafts-)Informatik</li>\n<li>Fundierte Berufserfahrung in der Umsetzung von Softwarekomponenten im BI-Umfeld, z. B. bei ETL-Strecken</li>\n<li>Erfahrung in Design und Umsetzung von BI-Anwendungen</li>\n<li>Idealerweise Kenntnisse im Umfeld der Teradata-Technologie</li>\n<li>Optionale Kenntnisse im Umfeld von IBM Cognos</li>\n<li>Kooperations- und Teamfähigkeit, Kommunikationsstärke sowie Flexibilität</li>\n<li>Lösungs- und Prozessorientierung, Eigeninitiative sowie eine selbstständige Arbeitsweise</li>\n</ul>\n<h2><strong>Das bieten wir dir:</strong></h2>\n<ul>\n<li>Eine interessante und abwechslungsreiche Tätigkeit an einem attraktiven Standort</li>\n<li>Ein kollegiales Miteinander und ein Betriebsklima, in dem wir gerne – auch standortübergreifend – zusammenarbeiten</li>\n<li>Work-Life-Balance durch flexible Arbeitszeiten</li>\n<li>Eine tarifliche Vergütung sowie attraktive Altersvorsorgemodelle</li>\n<li>Fachliche und persönliche Weiterbildung, u. a. durch. die Teilnahme an Schulungen und Tech-Konferenzen</li>\n<li>Arbeit in agilen Teams sowie mit aktuellen Technologien von namhaften Herstellern</li>\n<li>JobRad-Leasing und Corporate Benefits</li>\n<li>Angebote im Rahmen des betrieblichen Gesundheitsmanagements, z. B. Teilnahme am Gesundheits-Camp und Firmenlauf</li>\n<li>30 Tage Urlaub sowie drei weitere betriebsfreie Tage</li>\n</ul>\n<h2><strong>Gemeinsam mit dir digitalisieren wir den Markt der gesetzlichen Krankenversicherung und schaffen mit smarten Produkten Mehrwerte für Versicherte. Das sind wir:</strong></h2>\n<ul>\n<li>Von der Softwareentwicklung über den Datenaustausch und den Betrieb von Rechenzentren und Netzen bis hin zur Fachberatung: Als Managed Service Provider im IT-Markt der gesetzlichen Krankenversicherung treibt BITMARCK die Digitalisierung in der Branche und bei seinen Kunden mit innovativen Produkten, Lösungen und Services voran.</li>\n<li>Unser Kernprodukt ist mittlerweile eine der größten Java-Applikationen Europas.</li>\n<li>Wir unterhalten für unsere Kunden zwei große Rechenzentrums-Standorte mit über 3.600 Servern.</li>\n<li>1.400 Mitarbeiter schaffen deutschlandweit digitale Lösungen für Krankenkassen.</li>\n<li>30.000 Mitarbeitern in der GKV erleichtern wir ihre tägliche Arbeit – 85 % der Krankenkassen sind Kunden unserer Unternehmensgruppe.</li>\n<li>Mehr als 20 Mio. Versicherte profitieren somit von den Mehrwerten unserer Arbeit.</li>\n</ul>\n<p><strong>Haben wir dein Interesse geweckt? Dann zögere nicht und schick uns deine Online-Bewerbung über das Bewerbungsformular!</strong></p>\n<p><a href=\"https://bitmarck.redirect.your-jobresponse.com/softwareentwickler_m_w_d_business_intelligence_und_data_warehouse_essen/254023/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n<p><strong>Du hast Fragen? Dann ruf uns an – wir freuen uns auf dich!</strong>\nKontakt: BITMARCK Holding GmbH, Michaela Maschberger Tel. 0201 1766-2663</p>\n",
        "how_to_apply": "<p><a href=\"https://bitmarck.redirect.your-jobresponse.com/softwareentwickler_m_w_d_business_intelligence_und_data_warehouse_essen/254023/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZ3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50a528dec7b12ad387172fa5ed554f2352cfc621/BITMARCK_Logo.jpg"
    },
    {
        "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
        "created_at": "Sat Nov 10 02:02:55 UTC 2018",
        "company": "Sesame",
        "company_url": "http://sesamecare.com",
        "location": "New York; Berlin",
        "title": "Software engineer (back end)",
        "description": "<p>We’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.</p>\n<p>Our all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.</p>\n<p>We believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.</p>\n<p>We’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.</p>\n<p>We must be on to something, since we’re proud to say:</p>\n<ul>\n<li>We have engineering teams in New York and Berlin</li>\n<li>We've raised millions in funding to grow U.S. operations.</li>\n</ul>\n<p>Want to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.</p>\n<p><strong>About you:</strong></p>\n<ul>\n<li>Comfortable with Java and microservices.</li>\n<li>You seek and prefer simple solutions to complex problems.</li>\n<li>You strive to write clean, quality code and enjoy doing it.</li>\n<li>You maintain a healthy balance between perfectionism and actually getting stuff done.</li>\n<li>You either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.</li>\n<li>You love developing software. You have 2+ years of industry experience.</li>\n<li>You are a strong team player, have strong writing skills, and enjoy collaborating with others.</li>\n<li>You are attuned to the fundamentals of user design and user experience.</li>\n</ul>\n<p><strong>Our technology stack includes:</strong></p>\n<ul>\n<li>Java 10</li>\n<li>Spring Boot</li>\n<li>Kubernetes</li>\n<li>Docker</li>\n<li>GraphQL</li>\n<li>Pub/Sub</li>\n<li>Postgres</li>\n<li>Python</li>\n<li>NodeJs</li>\n</ul>\n<p><strong>Our Offer:</strong>\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.</p>\n<p><strong>Perks:</strong>\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.</p>\n<p>Sesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
    },
    {
        "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
        "created_at": "Tue Nov 06 20:19:44 UTC 2018",
        "company": "Cortex Building Intelligence",
        "company_url": "https://cortexintel.com/",
        "location": "New York, NY",
        "title": "Software Engineer, Full Stack (Rails, React)",
        "description": "<p><strong>Company Description</strong></p>\n<p>Cortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).</p>\n<p><strong>Job Description</strong></p>\n<p>At Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Creating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.</li>\n<li>Integrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.</li>\n<li>Working closely with our Customer Success team to support client onboarding and operations.</li>\n<li>Taking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.</li>\n<li>Strong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.</li>\n<li>Experience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.</li>\n<li>Product-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.</li>\n<li>Excellent verbal and written communication skills.  Committed, hard-working, and thoughtful.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.</li>\n<li>Unlimited paid time off.</li>\n<li>Your choice of 13” or 15” Macbook Pro.</li>\n<li>Work in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.</li>\n</ul>\n",
        "how_to_apply": "<p>Schedule a time to chat with our CTO, Justin Spradlin: <a href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\">https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
    },
    {
        "id": "1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "created_at": "Wed Oct 31 03:43:54 UTC 2018",
        "company": "Petal",
        "company_url": "https://www.petalcard.com/",
        "location": "New York City",
        "title": "Senior Software Engineer",
        "description": "<p>Petal is the first credit card for people without a credit history. We analyze cashflow from applicants' bank accounts to evaluate credit quality, which enables us to provide credit to populations traditionally excluded from financial services.</p>\n<p>As a Senior Software Engineer, you'll architect, design, and implement major sub-systems across our platform.</p>\n<p>What you'll do</p>\n<p>Lead projects and provide technical leadership in subject matter expertise.\nOwn large portions of the code base.\nDesign secure and highly reliable services to integrate with our data and credit card processing partners.\nBuild frameworks and products which will be used by other engineering teams at Petal.\nWrite tests and constantly seek to improve code quality and reliability.\nBring positive energy to every meeting and make your colleagues feel included and heard.</p>\n<p>Experience</p>\n<p>You've demonstrated your ability to build, test, release, and maintain complex products.\nYou demand high-quality code of yourself and others.\nYou love trying new tools, technologies, and frameworks, but are pragmatic—you get stuff done with what solves the problem you’re facing.\nYou love shipping new things rapidly and iterating based on real user behaviour. You have a knack for finding and eliminating inefficiency in your users’ workflows.\nYou’re enthusiastic about unit testing and performance, and knowing how to communicate the value of technical excellence to non-technical teammates.\nYou’re a great listener, but are willing to speak up when you see something that needs to be fixed. You ask questions when something isn’t clear.</p>\n<p>Understanding that smart, hungry people can rapidly learn new technologies, here is our tech stack: <a href=\"https://stackshare.io/petal\">https://stackshare.io/petal</a></p>\n",
        "how_to_apply": "<p>Email your LinkedIn profile to <a href=\"mailto:nathan@petalcard.com\">nathan@petalcard.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--141ec03885a07949373c47fc21d75fe420c3ab16/54a97145-8c66-4c73-aeb7-1f261a002122"
    }
]