[
    {
        "id": "3e378b91-7cc0-486e-b18d-518ab29569e3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3e378b91-7cc0-486e-b18d-518ab29569e3",
        "created_at": "Wed Sep 11 18:59:59 UTC 2019",
        "company": "Simon & Schuster ",
        "company_url": "https://www.simonandschuster.com/",
        "location": "New York, NY",
        "title": "Lead Software Engineer",
        "description": "<p>Simon &amp; Schuster is seeking a Lead Software Engineer to join a rapidly growing team focused on impacting the world of publishing through research and innovation. Working with a team of data scientists, data engineers, designers, and domain experts, you will be involved in rapidly prototyping, developing, and deploying the platforms that put insights and information into the hands of decision-makers.</p>\n<p>From databases to serverless applications, you will be designing, deploying , and managing the systems that connect our real-world data to the books and authors that inform and entertain our world. As a Full Stack (Engineer|Developer) you will engage with engineers and domain experts across the organization, collaborating to design and deploy innovative new products and services. From inception to production, you will onboard, integrate and deploy an array of cutting-edge tools and technologies to seamlessly deliver our solutions.</p>\n<p>Publishing experience is not required. Instead we are seeking teammates with curiosity, problem-solving skills, and a thirst for knowledge.</p>\n<p>Responsibilities:</p>\n<p>●     Scale team success from prototype to production.\n●     Own the software engineering aspects of our data services and applications.\n●     Design, build, test, and deploy solutions serving the entire organization.\n●     Be the “go to” engineer for our products and services.\n●     Tailor and drive the creation and adoption of best practices for software engineering for our team and peer engineering teams across the organization.\n●     Work with users, designers, developers, and analysts to ensure requirements-driven engineering in all we do.\n●     Ensure high availability and security are maintained in the products and services delivered by our team.</p>\n<p>Qualifications:\n●     5+ years experience in web application development and managing deployments\n●      Experience with full-stack development: Front-end, web servers, databases and storage.\n●      Deep understanding of modern software development practices (CI/CD, Continuous Monitoring, Testing, Documentation)\n●     Experience in production commercial with architecting and managing cloud deployments (GCP, AWS, Azure, etc.)\n●     Proficiency with Linux, SQL, Python, and Javascript required\n●     Solid background working with large-scale and fast-moving data technologies (Streaming, NoSQL, Object-stores, etc.)\n●     Familiarity with common build systems, Github/Gitlab, Confluence, JIRA\n●     Ability to work effectively in teams of technical and non-technical people.\n●     Ability to work independently and effectively\n●     Desire to research and communicate requirements and solutions.</p>\n",
        "how_to_apply": "<p>Apply Online: <a href=\"https://cbs.avature.net/cbssscareers/JobDetail/Lead-Software-Engineer/14487\">https://cbs.avature.net/cbssscareers/JobDetail/Lead-Software-Engineer/14487</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDF4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--acf24dd4bdd4f94a7d7a2dfc717ef5415bad86ce/43811-1.jpg"
    },
    {
        "id": "e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e43045e1-b6ee-4916-b9b1-ebf108033a53",
        "created_at": "Mon Sep 09 15:29:25 UTC 2019",
        "company": "Noe & Associates",
        "company_url": "http://http",
        "location": "New York, NY",
        "title": "Web Developer",
        "description": "<p>A leading international branding and design consultancy is seeking a seasoned Web Developer who will be responsible for coding innovative websites for world renowned premium brand, real estate, hospitality, architecture and design clients.</p>\n<p>The Web Developer will be proficient in building and maintaining small to medium size websites in a fast paced environment. Experienced in working with a team of designers and shipping code as an individual contributor within the team. Individual will care about writing elegant code and look for opportunities to build user-friendly websites that fulfill the goals of an identity system.</p>\n<p>Ideal candidate will have a strong interest in design, or a desire to work closely with designers during the design phase of the project. You’ll learn about the details that make the brand identity work well on multiple levels, and eventually help guide the website design along interesting pathways based on technical opportunities and limitations.</p>\n<p>Responsibilities will include:</p>\n<p>▪\tWebsite and software application designing, building and maintenance, including integration    with third party API.</p>\n<p>▪\tUsing scripting or authoring languages, management tools, content creation tools, applications and digital media.</p>\n<p>▪\tConferring with clients and teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions.</p>\n<p>▪\tPerforming Website updates as required.</p>\n<p>▪\tDeveloping or validating test routines and schedules to ensure that test cases mimic external interfaces and address all browser and device types.</p>\n<p>▪\tMaintaining an understanding of the latest Web applications and programming practices.</p>\n<p>▪\tIdentifying problems uncovered by client feedback and testing, and correcting problems.</p>\n<p>▪\tEvaluating code to ensure it meets industry standards, is valid, is properly structured, and is compatible with browsers, devices and operating systems.</p>\n<p>Candidate should possess following skills:</p>\n<p>▪\tBachelor degree in Computer Science or related field, or relevant experience.</p>\n<p>▪\tSolid knowledge and experience in programming applications.</p>\n<p>▪\tProficient in JavaScript, HTML, HTML5, CSS3.</p>\n<p>▪\tDeep knowledge of Ruby on Rails and comfortable with Postgres and Sass.</p>\n<p>▪\tFamiliarity with version control, ideally Git and a GitHub-based workflow.</p>\n<p>▪\tProficient in back-end development and maintenance on Heroku, AWS &amp; Linode services. Also, familiarity with virtual private servers (VPS) and Linux environment.</p>\n<p>▪\tSelf-starter with strong communication and interpersonal skills.  Organized, reliable, with the ability to multi-task and manage multiple deliverables/projects.</p>\n<p>▪\tFamiliarity with PHP based frameworks, such as WordPress or Drupal or prior experience in e-commerce platforms such as Magento are a plus.</p>\n",
        "how_to_apply": "<p>If interested, please email resume, portfolio and cover note to <a href=\"mailto:careers@noeassociates.com\">careers@noeassociates.com</a></p>\n",
        "company_logo": null
    },
    {
        "id": "9ecfe037-40c7-4f69-b447-385eab05bd03",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9ecfe037-40c7-4f69-b447-385eab05bd03",
        "created_at": "Mon Sep 02 17:22:58 UTC 2019",
        "company": "CreditZO",
        "company_url": "https://creditzo.com",
        "location": "New York, NY",
        "title": "Lead Engineer & CTO",
        "description": "<p>​<strong>Have you always wanted to work in a dynamic, fast moving startup?</strong>\n\n<strong>We are CreditZO, an exciting start up that aims to disrupt the credit restoration industry.</strong></p>\n\n<p><strong>All about CreditZO:</strong></p>\n<p>We are a growing team of talented Marketers and Engineers whose <em>mission is to develop a fully automated credit restoration solution.</em> All of us are entrepreneurs at heart, seeking to move quickly and nimbly in order to find new ways of delivering value to our customers. We strive on finding solutions to most complex problems and have a solid track record of creating and scaling multiple successful start-up ventures.</p>\n<p>You will be joining at a very exciting time as we have recently launched our fully automated consumer product after 15 months of development. We are planning on scaling up rapidly and are looking for an ambitious, talented Sr. Engineer to take on the role of company CTO. Our tech stack features the latest technology in a cloud environment. The position is challenging and stimulating and is in a fast-paced results oriented company. The business is post MVP and has a product on the market (alleviating a lot of start up risks).</p>\n<p><a href=\"https://creditzo.com/\">CreditZO</a></p>\n<p><strong>What you will get to do:</strong></p>\n<ul>\n<li>Run day to day operations for in-house development and cloud based infrastructure.</li>\n<li>Build additional sophisticated features to add to our service</li>\n<li>Build, support and mentor effective teams</li>\n<li>Design and create services and system architecture for your projects, and contribute and provide feedback to other team member.</li>\n<li>Improve code quality through writing unit tests, automation and performing code review</li>\n<li>Participate in brainstorming sessions and contribute ideas to our technology and algorithms</li>\n<li>Work with the product manager to understand end-user requirements and then translate that into a pragmatic and effective technical solution.​</li>\n</ul>\n<p><strong>Required Technical Skills:</strong>\n<strong>6+ years hands-on development and delivery experience as a web based software developer.</strong></p>\n<p><strong>Significant experience with:</strong></p>\n<ul>\n<li>Development experience with Java or Kotlin on the JVM</li>\n<li>Experience with No-SQL (preferably MongoDB)</li>\n<li>Front end web development with Typescript or JavaScript</li>\n<li>Experience with cloud base infrastructure (preferably AWS)</li>\n<li>Work independently on projects able to execute to completion</li>\n<li>RabbitMQ or similar messaging-broker platform</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Angular 2-8</li>\n<li>AWS S3, CloudFront</li>\n<li>Experience in a startup or small dev shop</li>\n<li>Experience in e-commerce/public-facing web services</li>\n</ul>\n<p><strong>Other:</strong></p>\n<ul>\n<li>Experience with leading and inspiring software development teams</li>\n<li>Strong people skills that contribute to an open and collaborative environment</li>\n<li>Experience in communicating technical vision to a variety of team members</li>\n</ul>\n",
        "how_to_apply": "<p>Email your Resume to:\n<a href=\"mailto:recruit@creditzo.com\">recruit@creditzo.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXB3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--045c6faf5fcdbb1d2b1a670f9f3e5d71d5fdb5e5/logo-creditzo.jpg"
    },
    {
        "id": "6cc20231-5834-4766-98c7-7a5daac8e50d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6cc20231-5834-4766-98c7-7a5daac8e50d",
        "created_at": "Thu Aug 29 21:44:11 UTC 2019",
        "company": "Kettle",
        "company_url": "https://wearekettle.com/",
        "location": "New York, NY",
        "title": "Senior Back-End Web Developer",
        "description": "<p>Your task.</p>\n<p>We're looking for a full-time Back-end Web Developer (Ruby, Python, or PHP). At Kettle, you'll be building  web applications—everything from interactive experiences to complete websites—for clients ranging from Fortune 100 companies to budding start-ups. We're looking for a versatile developer comfortable with the model-view-controller pattern and flexible enough to work with a variety of modern Web frameworks. You'll be working hand-in-hand with our front-end developers to construct the site's functionality.</p>\n<p>We’d like to know that you can:</p>\n<p>Build complex, dynamic web applications from prototyping to deployment using modern MVC frameworks and design patterns\n4+ years experience in PHP, Python, or Ruby\nEfficiently integrate and debug third-party APIs\nBasic Linux system skills and AWS console experience\nWorking knowledge of Docker containers, virtual machines, and automated provisioning\nHTML, CSS, and JavaScript fundamentals</p>\n<p>The right candidate should also have:</p>\n<p>An insatiable curiosity for new techniques and a razor-sharp eye for detail\nA love for programming and eagerness to tackle unique, challenging problems\nYou’re serious about your work, but don’t take yourself too seriously\nA passion for collaborating with a creative team to build great products</p>\n<p>Why it’s an awesome gig:</p>\n<p>Direct new web projects from scratch. As the lead back-end developer, you will be entrusted with a wide range of responsibilities and be able to rapidly iterate, collaborate, and learn from a large, multidisciplinary team.\nChoose and use the best tools. Build projects using modern packages, services, and frameworks. You will be given wide autonomy to choose the right tools for the problem.\nTouch many different clients across industries and needs. Our projects aren’t “one size fits all.” This will let you experiment with new ways of thinking and working to build amazing products.</p>\n<p>A little about us:</p>\n<p>An independent digital agency with offices in New York City and San Francisco. We’re a team of makers, doers, and passionate problem-solvers with a simple mission: to make tomorrow better. We spend countless hours tinkering and asking questions until we unequivocally know the product is in its purest, most elegant form. Our strengths are creating user-centric products, keeping it simple, and telling great stories. Our weaknesses are baked goods, french fries, and karaoke.</p>\n<p>More info:</p>\n<p>Candidate must be a US citizen or have a work permit.\nCompetitive compensation based on experience.\nAll candidates should submit code samples or links to demonstrate your abilities</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:lauren.marusich@wearekettle.com\">lauren.marusich@wearekettle.com</a> and <a href=\"mailto:kacey.aumack@wearekettle.com\">kacey.aumack@wearekettle.com</a> along with code samples or links to demonstrate your abilities in this role</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGx3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d88bebe6435d2410432801a554467c5092ed1d11/Kettle%20Logo.png"
    },
    {
        "id": "d4b0b800-1adc-4c9f-900b-8d43fd4d44aa",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d4b0b800-1adc-4c9f-900b-8d43fd4d44aa",
        "created_at": "Thu Aug 29 21:36:15 UTC 2019",
        "company": "Kettle",
        "company_url": "https://wearekettle.com/",
        "location": "New York or anywhere in the US",
        "title": "Senior Front-end Web Developer",
        "description": "<p>Your task.</p>\n<p>Kettle is seeking a front-end developer with a passion for solving problems and making creative concepts a reality through clean, maintainable code. The first client you’d be working alongside has been celebrated for its iconic design and groundbreaking engineering. And in the dev community they’re known for a meticulous approach to code that’s so pure, it’s considered an art in and of itself.</p>\n<p>We’d like to know that you can:</p>\n<p>5+ years experience in front-end web development\nComprehensive knowledge of HTML, CSS, and JavaScript\nA track record of building component-based SPAs using React\nExcellent verbal/written communication and time management skills\nProven debugging and troubleshooting skills\nFamiliarity with a variety of front end tooling systems</p>\n<p>The right candidate should also have:</p>\n<p>An insatiable curiosity for new techniques and a razor-sharp eye for detail\nA love for programming from scratch with object-oriented JavaScript (DOM literacy is a must!)\nYou’re serious about your work, but don’t take yourself too seriously\nA passion for collaborating with a creative team to build great products</p>\n<p>Why it’s an awesome gig:</p>\n<p>Build next-gen web applications in JavaScript. Help elevate JavaScript to the level of its more respected brethren through unit tests, headless testing, and by contributing to core libraries authored and maintained by many of the world's best engineers.\nChoose and use the best tools. Build greenfield projects using the most modern and suitable packages, services, and frameworks. Your first project will be in React and Redux.\nLead the charge in accessibility. Be on the forefront of implementing truly accessible content at scale. And with this client, ‘at scale’ means really, really big.\nCraft pixel-perfect, butter-smooth animations. Leverage the team's shared knowledge to exploit all the quirks of modern browsers for animations that perform consistently and beautifully.</p>\n<p>More info:</p>\n<p>Candidate must be a US citizen or have a work permit.\nCompetitive compensation based on experience.\nAll candidates should submit code samples or links to demonstrate your abilities; a GitHub, Bitbucket account, or a Stack Overflow profile is sufficient.</p>\n",
        "how_to_apply": "<p>Please email your resume to <a href=\"mailto:lauren.marusich@wearekettle.com\">lauren.marusich@wearekettle.com</a> along with code samples or links to demonstrate your abilities. A GitHub, Bitbucket account, or a Stack Overflow profile is sufficient.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGR3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--efe7363292fb1ff0b3cbde60da6febdddcb1cf68/Kettle%20Logo.png"
    },
    {
        "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
        "created_at": "Mon Nov 19 19:40:01 UTC 2018",
        "company": "Prosek Partners",
        "company_url": "https://www.prosek.com",
        "location": "Fairfield, CT",
        "title": "Front End Developer",
        "description": "<p>Background</p>\n<p>Prosek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.</p>\n<p>The Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.</p>\n<p>Technical skills:</p>\n<ul>\n<li>Design overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications</li>\n<li>Understanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design</li>\n<li>Understanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms</li>\n<li>Delivering reusable components, code and front-end libraries for future use</li>\n<li>Translating designs and wireframes into high quality, tested code</li>\n<li>Experience with interactive web elements and motion</li>\n<li>Able to identify opportunities for process and tool improvements</li>\n<li>Proficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM</li>\n<li>Understanding of CSS pre- and post-processors</li>\n<li>Experience working with third party services, APIs, and content management systems.</li>\n<li>Proficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign</li>\n<li>Comprehensive awareness and interest in new technologies</li>\n<li>Understanding of full-stack requirements and deployments</li>\n<li>Enforce front-end code compliance with web for cross-browser and platform compatibility</li>\n</ul>\n<p>As a Front End Developer, you will be expected to:</p>\n<ul>\n<li>Be self-motivated, detail-oriented and confident</li>\n<li>Capable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements</li>\n<li>Translate ideas, end-user needs, design criteria, and technical features into quality web productions</li>\n<li>Present and defend technical recommendations to the team</li>\n<li>Able to speak not just passionately about your work but also plainly to those who are inexperienced</li>\n<li>Have a strong grasp of storytelling through layout and information design</li>\n<li>Possess excellent written and verbal communication skills</li>\n<li>Be comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers</li>\n<li>Able to work under tight deadlines, with little supervision</li>\n<li>Rise above the competition: tell us about your experience with mobile app development</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Bachelor's degree in computer science or related field</li>\n<li>3-5 years of professional IT-related experience</li>\n<li>Demonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends</li>\n<li>Fluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:developerjobs@prosek.com\">developerjobs@prosek.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"
    },
    {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
    },
    {
        "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
        "created_at": "Wed Nov 14 22:16:02 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Lead Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer with proven leadership and management experience.</p>\n<p>You are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.</p>\n<p>Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities</strong>:</p>\n<ul>\n<li>Provide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews</li>\n<li>Help plan and execute team and individual goals, with an eye on team growth and development</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability</li>\n<li>Act as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features</li>\n<li>Act as a expert who can provide technical help and guidance to the other front end developers</li>\n</ul>\n<p><strong>Requirements</strong>:</p>\n<ul>\n<li>Proven experience with technical leadership and management</li>\n<li>Experience architecting a front end codebase at scale</li>\n<li>Strong technical and non-technical communication skills</li>\n<li>Able to look at a design and break it into well organized reusable components</li>\n<li>Experience planning, ticketing, and executing team projects</li>\n<li>Comfortable with Git for version control</li>\n<li>Effective time management when working on multiple projects</li>\n<li>Passionate about front end performance with up-to-date knowledge of current techniques</li>\n<li>Familiar with Node.js and modern frontend build tooling</li>\n<li>Knowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS</li>\n<li>Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values</strong>:</p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability</em>.</p>\n<p><em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
    },
    {
        "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
        "created_at": "Wed Nov 14 22:11:05 UTC 2018",
        "company": "The Atlantic",
        "company_url": "http://theatlantic.com",
        "location": "Washington, DC & New York, NY",
        "title": "Senior Front End Developer",
        "description": "<p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.</p>\n<p><strong>Who You Are</strong></p>\n<p>You are an experienced developer and solid communicator with an interest in journalism and the media business.</p>\n<p>You’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.</p>\n<p>Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.</p>\n<p><strong>Primary Responsibilities:</strong></p>\n<ul>\n<li>Implement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people</li>\n<li>Champion ways to improve our front end tech stack, including tooling, unit testing, and architecture</li>\n<li>Collaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary</li>\n<li>Mentor junior developers and act as a subject expert</li>\n<li>Thinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability</li>\n<li>Work to continually reduce our front end website load time</li>\n<li>Communicate and collaborate with both technical and non-technical members of the team</li>\n</ul>\n<p><strong>Requirements:</strong>\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website</p>\n<p><strong>Benefits</strong></p>\n<p>Employees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.</p>\n<p><strong>Atlantic Media Values:</strong></p>\n<p>Across Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –</p>\n<ul>\n<li>\n<strong>Force of Ideas</strong>: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.</li>\n<li>\n<strong>Spirit of Generosity</strong>: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.</li>\n</ul>\n<p><em>Atlantic Media is an EOE of Minorities/Women/Vets/Disability.</em></p>\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n",
        "how_to_apply": "<p>Apply online: <a href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\">https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
    },
    {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
    },
    {
        "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977",
        "created_at": "Tue Nov 06 20:25:06 UTC 2018",
        "company": "Constructive",
        "company_url": "http://constructive.co",
        "location": "New York, New York",
        "title": "Sr. Web Developer (Full-Stack/WP), Social Change Design Agency",
        "description": "<p><strong>Sr. Web Developer (Full-Stack/WP), Digital Agency for Social Change</strong></p>\n<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.</p>\n<p>If you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p><strong>A bit about the role</strong></p>\n<p>Sr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.</p>\n<p><strong>A bit about us</strong></p>\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.</p>\n<p><strong>A bit about diversity</strong></p>\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.</p>\n<p><strong>What we need you to do extremely well</strong></p>\n<p>We’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.</p>\n<ul>\n<li>Understand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.</li>\n<li>Collaborate across teams to plan and execute ambitious digital projects.</li>\n<li>Develop backend and frontend, taking ownership of your projects from start to finish.</li>\n<li>Participate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.</li>\n<li>Document your work to make it easier for other developers, both now and in the future, to work with what you’ve built.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.</li>\n<li>Contribute to ongoing development and support for existing websites.</li>\n<li>Contribute to developing proposals and estimates for projects you will be a lead developer.</li>\n<li>Be a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li>Have a sense of humor. Seriously, life can be stressful enough these days.</li>\n</ul>\n<p><strong>Expertise that’s important in our work</strong></p>\n<p>Right now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.</p>\n<ul>\n<li>Expert-level Wordpress Development (Min 3 years experience)</li>\n<li>Expert CSS chops (and SCSS!)</li>\n<li>Strong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)</li>\n<li>Strong preprocessor experience (Webpack / Gulp)</li>\n<li>Strong Git experience</li>\n<li>Experience with MySQL</li>\n<li>Experience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)</li>\n<li>Comfortable with D3</li>\n<li>Comfortable with AWS</li>\n<li>Comfortable with Server Administration &amp; DevOps</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:</p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<ul>\n<li>Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16 days)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place.</li>\n</ul>\n<p><strong>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "how_to_apply": "<p>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</p>\n",
        "company_logo": null
    },
    {
        "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45",
        "created_at": "Thu Nov 01 13:09:37 UTC 2018",
        "company": "Jane Street",
        "company_url": "http://janestreet.com",
        "location": "New York, NY; London, UK; Hong Kong",
        "title": "Software Developer (Functional Programming)",
        "description": "<p>Software Developer</p>\n<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p>\n<p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p>\n<p>We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.</p>\n<p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.</p>\n<p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href=\"http://ocaml.janestreet.com/?q=node/61\">http://ocaml.janestreet.com/?q=node/61</a>), and our programming blog (<a href=\"http://ocaml.janestreet.com\">http://ocaml.janestreet.com</a>).</p>\n<p>We also have extensive benefits, including:</p>\n<ul>\n<li>90% book reimbursement for work-related books</li>\n<li>90% tuition reimbursement for continuing education</li>\n<li>Excellent, zero-premium medical and dental insurance</li>\n<li>Free lunch delivered daily from a selection of restaurants</li>\n<li>Catered breakfasts and fresh brewed Peet's coffee</li>\n<li>An on-site, private gym in New York with towel service</li>\n<li>Kitchens fully stocked with a variety of snack choices</li>\n<li>Full company 401(k) match up to 6% of salary, vests immediately</li>\n</ul>\n<p>More information at <a href=\"http://janestreet.com/culture/benefits/\">http://janestreet.com/culture/benefits/</a></p>\n",
        "how_to_apply": "<p>Please apply through our web app form at  <a href=\"https://www.janestreet.com/join-jane-street/apply/\">https://www.janestreet.com/join-jane-street/apply/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6dec9502d27094bbc9c7ff6c33806d0cdbb6faf/ac79023f-6a10-488b-be9f-751264dd8d06"
    },
    {
        "id": "df5b47be-d612-11e8-88f4-50633736745c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/df5b47be-d612-11e8-88f4-50633736745c",
        "created_at": "Mon Oct 22 15:56:13 UTC 2018",
        "company": "Constructive",
        "company_url": "http://www.constructive.co",
        "location": "New York City",
        "title": "Technology Team Lead, Design Agency for Social Impact",
        "description": "<p>Constructive (<a href=\"https://constructive.co\">https://constructive.co</a>), a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.</p>\n<p>If you’re an experienced technologist who wants to work on websites and products that are at the front of the field, knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p>##A bit about the role\nOur Technology Team Lead needs a holistic understanding of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.</p>\n<p>That’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.</p>\n<p>##A bit about us\nWe’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office, so there’s music and joking mixed-in with being heads-down on work.</p>\n<p>##A bit about diversity\nWe believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.</p>\n<p>##What we need you to do extremely well\nThis role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well.</p>\n<ul>\n<li>\n<strong>Provide strong technical leadership</strong>—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.</li>\n<li>\n<strong>Guide development team</strong> and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meets expectations.</li>\n<li>\n<strong>Work with stakeholders to define strategic goals</strong> and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.</li>\n<li>\n<strong>Develop requirements, specifications, and architecture</strong> to document what we’re building and what’s been built.</li>\n<li>\n<strong>Lead development of ambitious digital products,</strong> serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.</li>\n<li>\n<strong>Be a hands-on developer</strong> who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed.</li>\n<li>\n<strong>Review code and provide feedback</strong> on work done by other developers; oversee the UAT and QA processes in coordination with project managers.</li>\n<li>\n<strong>Improve best practices, recommend tools, and build frameworks</strong> that make our work more efficient, effective, and technically front-of field.</li>\n<li>\n<strong>Be the face of Constructive’s technical expertise</strong> throughout client engagements, in the development community, and when needed in our sales cycle.</li>\n<li>\n<strong>Contribute to developing proposals and estimates</strong> for technical projects, particularly those with complex requirements.</li>\n<li>\n<strong>Lead vetting and hiring of web developers</strong> and external development partners.</li>\n<li>\n<strong>Be a team player</strong> who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li><strong>It definitely helps if you also have a good sense of humor</strong></li>\n</ul>\n<p>##Expertise that’s important in our work\nRight now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.</p>\n<ul>\n<li>Expert Wordpress &amp; Drupal development (Minimum 5 years of experience)</li>\n<li>Expert front-end development experience</li>\n<li>Strong experience with Webpack / Gulp / SCSS</li>\n<li>Strong experience doing large-scale content migrations</li>\n<li>Strong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)</li>\n<li>Experience with Data Visualization (D3, Highcharts)</li>\n<li>Experience with Infrastructure, System Administration &amp; DevOps</li>\n<li>Experience with ES6, Node, React</li>\n</ul>\n<p>##What’s in it for you?\nWork/Life balance matters at Constructive, and we do our best to make sure everyone is well-taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Added to your base salary, here’s what we have on tap for 2018-2019 to add:</p>\n<p>##Benefits &amp; Perks</p>\n<ul>\n<li>Company-Sponsored Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus (Approx 10% of company profit distributed equally)</li>\n<li>Discretionary performance-based bonuses</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year’s</li>\n<li>1/2-day Summer Fridays (Approx 16)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly &amp; Annual employee-voted \"shout-out\" gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place</li>\n</ul>\n",
        "how_to_apply": "<p><strong>Interested? Great! Then please send an email to titled “Technology Team Lead” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>• A resume</li>\n<li>• A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>• Links to your own website, websites you’ve worked on, github, whatever</li>\n<li>• Desired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3235bba838d5ca1495e8b2f6b73a0e54ee613498/caadf965-8957-438b-b2f8-12af175c8721"
    },
    {
        "id": "c6877fec-7b8d-49b2-a4db-a6d9c5005be1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c6877fec-7b8d-49b2-a4db-a6d9c5005be1",
        "created_at": "Thu Sep 19 18:38:26 UTC 2019",
        "company": "Pace Scheduler",
        "company_url": "https://www.pacescheduler.com",
        "location": "Chicago, IL",
        "title": "Senior Python/Django Engineer",
        "description": "<h1>Senior Software Engineer at Pace Scheduler</h1>\n<h2>Who Are We?</h2>\n<ul>\n<li>We are a software team of 5 people focused on a rapidly growing product called Pace Scheduler. We built this product in-house and it is currently going through a period of rapid adoption across the country. The team you would be a part of has been around for 5 years. We are based in Naperville, IL, but some employees live elsewhere and work remotely.</li>\n<li>We are part of a larger parent company, Pace Systems, which has been around since 1983. Pace Systems employs 120 people and deals in IT, Software, Security, Audio Visual, and other disciplines.</li>\n<li>Pace Scheduler is built specifically for emergency services (Police, EMS, Fire, etc.) as they have intricate rules, stipulations, and contractual obligations that simply cannot be handled by plain-old scheduling programs. We have some innovative ways to streamline these clients’ workflows. Our clients are a pleasure to work with and send us tons of positive feedback that we enjoy.</li>\n<li>We are growing at an ever-increasing rate, which is fun, challenging, and exciting. Departments using our software range in size from 15 users, all the way to several hundred users. Naturally, our largest portion of clients are located in the Chicagoland area, however we have clients spread all over the U.S., from California to New York, and we hope to continue growing for a long time. Our clients have unique needs so we are constantly evolving.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Full stack software development across all parts of our system. Our code base is still a manageable size and each person on our team should currently be able to work on any part of it. A majority of the work tends to be on the backend (Python/Django). We hope a vast majority of your time will be spent actually building software.</li>\n<li>Manage releases - Code review, perform final tests, merge code, resolve conflicts, deploy.</li>\n<li>Write specifications for new features, improvements, or bugs that will be handled by either yourself or another developer.</li>\n<li>Once you are fully up to speed, many of the items you will be working on will not be fully fleshed out specifications but just a loose idea that you will need to think deeply about in order to turn it into a new feature/improvement.</li>\n<li>Interact directly with customers and turn their needs into product ideas, specifications, and code. You will need to be smart about this and dig down to truly understand their underlying need, not just the enhancements they are proposing. Often we can address the underlying need in a more elegant manner than what the clients originally proposed.</li>\n<li>Help guide the direction of our technical team. You will be a central piece of our technology team and your leadership will be critical for our long term success.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>401k</li>\n<li>Health &amp; Dental Insurance</li>\n<li>Salary: $90k-$140k depending on experience, with numerous opportunities for advancement as you grow.</li>\n<li>Flexibility and agility of a small team (5 people) with the financial backing of a larger company (120 people).</li>\n<li>New-hire personal stipend that can be used for work related items, such as mice/keyboard, webcam, desk, chair, etc.</li>\n<li>Learning opportunities at all corners. We want you to help our product grow, but we also want our company to help YOU grow.</li>\n<li>Recognition and support of mental health, a solid work-life balance, and the instrumental role they both play in a person’s life and work.</li>\n<li>Product Milestone rewards. As our product grows, we award team members with various forms of compensation, typically in the form of gift cards, stipends, or equipment upgrades.</li>\n</ul>\n<h2>Required Skills</h2>\n<ul>\n<li>Smart, hard working, and thorough. This trumps just about everything else, including specific technology knowledge, as those skills can be learned.</li>\n<li>Be very self-sufficient. You will be a senior engineer in a key role and will find yourself at the center of everything. You will need to be able to prioritize what is meaningful and what is not to make the best decisions on behalf of the company.</li>\n<li>Attention to detail. The problems we are tackling are not trivial, so it’s important to think through edge cases and how clients may actually use any new functionality. It is harder to modify software after it’s out in the wild, so it’s important to think deeply right from the start.</li>\n<li>Intrigue. We want you to learn and grow while you work with us. We encourage and facilitate learning opportunities for all our team members, as it benefits both you and the product. Lifelong learners are a perfect fit for our team, always looking for that next hill to climb or challenge to overcome.</li>\n<li>Discipline. We want our team members to have a healthy work-life balance, and the freedom to complete a task in the way that works best for them. We take the saying “Hire people you trust, trust the people you hire” seriously. We don’t want to micro-manage you, and you don’t want that either, so you need to be able to set tasks for yourself, devise tactics &amp; strategies that you think will work best to accomplish those tasks, then carry-out those plans.</li>\n<li>As cliché as it sounds, you need to be able to work in a team. We are a smaller team (~5 people in total). Because of this, we need and thrive on effective, efficient communication. We all know each others habits, attitudes, and opinions, and leverage those to communicate as effectively as possible with one another. One of the primary benefits of being a small team is that we can maintain this meaningful level of communication and be agile at all times.</li>\n<li>Familiarity with Python/Django</li>\n<li>Familiarity with or willingness to learn Vue.js, Firestore, Postgres</li>\n<li>Database design</li>\n<li>Code architecture</li>\n</ul>\n<h2>Non-Required skills that would just be nice to have</h2>\n<ul>\n<li>Dev-ops experience. We are hosted on Heroku so there is minimal work to be done here, but this experience is still nice to have.</li>\n<li>UI/UX design</li>\n<li>React Native experience</li>\n<li>iOS/Android deployment experience. We have a mobile app written in Vue.js in a thin React Native wrapper.</li>\n</ul>\n<p>We are a remotely distributed development team, but have a slight preference to hiring people who live near Chicago. Even if we are primarily working in different locations, it is fun to have the option of face-to-face time.</p>\n",
        "how_to_apply": "<p>To apply, please email your resume, a link to your github, and a link to your LinkedIn profile to <a href=\"mailto:careers@pacescheduler.com\">careers@pacescheduler.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEp5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--867313427a2e954faf52c7e89738f7f5673bdbac/logo.jpg"
    },
    {
        "id": "c27fb95a-0b4f-4c21-bb79-7713f08246a5",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c27fb95a-0b4f-4c21-bb79-7713f08246a5",
        "created_at": "Fri Sep 13 16:14:23 UTC 2019",
        "company": "UCHealth",
        "company_url": "http://UCHealth",
        "location": "Aurora",
        "title": "Mobile Application Developer, Native iOS and Android",
        "description": "<p>This is a full-time, exempt/salary position. You may be based in Metro Denver, Colorado Springs or Fort Collins. Some travel may be required.</p>\n<p>RESUME REQUIRED to be considered for this position.</p>\n<p>We are seeking an Application Developer with a highly motivated, team-centric work ethic. This person will primarily focus on the design, development, and delivery of mobile applications for Apple and Android devices.  As the Application Developer, you will be integral in helping to push the boundaries of technology within healthcare IT.</p>\n<p>Job Duties</p>\n<pre><code>     Develop mobile applications using Kotlin (Android) and Swift (Apple).  Able to work across both frameworks to build mobile applications. \n     Develop solutions that integrate with Electronic Health Record (EHR) and other 3rd party systems using native SDKs, web services, and other technologies\n     Elicit and analyze business processes and requirements from technical and non-technical teams.  Reading between the lines of what the user is asking for, and what the user really wants.\n     Deploy applications to iOS and Google App Stores\n     Troubleshoot and resolve issues related to mobile development\n</code></pre>\n<p>Requirements</p>\n<pre><code>     High School Diploma or GED\n     3 years of relevant experience\n     At least 2 years of custom development experience in Kotlin and/or Swift technologies, or Java on Android and/or Objective C on iOS.\n     Excellent organizational and time management skills; ability to work independently and solve problems.\n     Passion and energy to get the job done.\n     Excellent written and verbal communication skills\n     Experience identifying and prioritizing issues; troubleshooting complex issues\n     A desire to learn new skills and work with cutting edge technologies\n     Commitment to quality; ability to review and correct deficiencies in own work and help others in troubleshooting code.\n</code></pre>\n<p>Preferred</p>\n<pre><code>     Apple Swift or Objective C development experience\n     Kotlin or Java/Android development experience\n     XCode / Android Studio experience\n     Agile delivery of software including usage of Azure DevOps tools for sprint/story tracking and continuous integration concepts\n     Experience with Bootstrap and Responsive design technologies preferred, but not required\n</code></pre>\n<p>At UCHealth, we do things differently</p>\n<p>We believe in something different: a focus on the individuality of every person. In big ways and small, we exist to improve the extraordinary lives of all those we serve.   As Colorado’s largest and most innovative health care system, we as a team deliver on the commitment to provide the best possible experience for our patients and their families. We foster a true human connection and give people the freedom to live extraordinary lives. A career at UCHealth is more than a job, it’s a passion.</p>\n<p>Going beyond quality requires the perfect balance of talent, integrity, drive and intellectual curiosity. We are looking for individuals who recognize, like us, that the world of medicine is ever-changing and are motivated to do what is right, not what is easy.  We support creativity and curiosity so that each of us can find the extraordinary qualities within ourselves. At UCHealth, we’ll do everything in our power to make sure you grow and have a meaningful career. There’s no limits to your potential here.</p>\n<p>Be Extraordinary. Join Us Today!</p>\n<p>UCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution.  As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements.  No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual’s race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status.  UCHealth does not discriminate against any “qualified applicant with a disability” as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.</p>\n",
        "how_to_apply": "<p><a href=\"https://careers.uchealth.org/job/UCHDA005N29147/Mobile-Application-Developer-Native-iOS-and-Android?&amp;utm_source=GitHub&amp;utm_campaign=Bayard_oneoffs&amp;utm_medium=Jobboard\">https://careers.uchealth.org/job/UCHDA005N29147/Mobile-Application-Developer-Native-iOS-and-Android?&amp;utm_source=GitHub&amp;utm_campaign=Bayard_oneoffs&amp;utm_medium=Jobboard</a></p>\n",
        "company_logo": null
    },
    {
        "id": "99a4987e-6b50-11e8-848b-794d9c4e4459",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/99a4987e-6b50-11e8-848b-794d9c4e4459",
        "created_at": "Wed Nov 07 20:22:57 UTC 2018",
        "company": "WHQ",
        "company_url": "https://worldhqinc.com/",
        "location": "Chicago",
        "title": "Front End Developer",
        "description": "<p>You’re always looking at new technologies and you push to innovate. WHQ is where you need to be. We’re a team of designers, developers, and strategists who work on web, mobile, environmental and brand projects. Tough problems demand big ideas. We think quickly and are always looking for ways to push our clients and ourselves. Think you'd fit in? Read on.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Write solid HTML, CSS and JavaScript for web sites and applications</li>\n<li>Build responsive web sites that function perfectly on any device or browser size</li>\n<li>Perform cross-browser compatibility tests and iterate to work through bugs</li>\n<li>Jump into existing JavaScript applications, or start them from the ground up</li>\n<li>Learn new technologies and share ideas</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Expert skills in HTML, CSS and JavaScript</li>\n<li>Experience with JavaScript frameworks</li>\n<li>Experience will Less or Sass</li>\n<li>Solid command of responsive layouts</li>\n<li>Experience with Git and version control tools</li>\n<li>Testing experience is a plus</li>\n<li>3+ years within the industry</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://worldhqinc.com/join/front-end-developer/\">https://worldhqinc.com/join/front-end-developer/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8bc2fdb24f009de08e47d677571a9d6652ee2b42/fb089168-dd99-4765-8189-ff12c35b8591"
    },
    {
        "id": "c307e4ca-d6a6-11e8-8f6e-f00ef74f7cb0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c307e4ca-d6a6-11e8-8f6e-f00ef74f7cb0",
        "created_at": "Tue Oct 23 09:36:02 UTC 2018",
        "company": "Squirro",
        "company_url": "https://www.squirro.com",
        "location": "Zurich",
        "title": "Senior Python Engineer",
        "description": "<p>We’re looking for senior engineers with solid Python skills to join our team, which is building a platform, called Squirro, for unstructured data analysis.</p>\n<p>Squirro can ingest data from anywhere, be it public on the web or social medium or internal, such as a CRM, database or ITSM system, and add structure to it so that it can be delivered to business users using our dashboard visualisations or consumed by other systems using our APIs. We add structure to unstructured data by employing a range of techniques, from statistical and Bayesian models to supervised and unsupervised machine learning which we serve to our customers as a unified and patented technology we call Smartfilters. Meanwhile, for our users, we provide a simple interface to access these technologies so that anyone with basic analytical skills can get value out of their companies unstructured data.</p>\n<p>Our customers are some of the largest banks and financial institutions in the world, across the US, UK, EU, Switzerland and Asia. Many of our customers are just beginning to discover the potential of unstructured data analysis and we’re excited by the opportunity as an early mover in this young market. While we host some of these customers in the cloud, the majority prefer to install Squirro on-premise for security reasons.</p>\n<p>We need you to help us build out and scale this platform, as our customers apply it to ever growing volumes of data and discover new ways to structure and analyse that data.</p>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Exceptional programming experience in Python</li>\n<li>Extensive knowledge of UNIX/Linux from a developers perspective</li>\n<li>Strong track record in software systems design, from initial implementation to performance optimisation and scaling</li>\n<li>Experience developing professionally as part of a team, giving and receiving code reviews, test-driven development etc.</li>\n<li>Good communication skills with fluency in English</li>\n<li>Swiss citizenship or work permit in Switzerland, or living and working in UK, EU or EFTA member state. We’d love to hire people worldwide but Swiss immigration law makes this problematic except in rare cases.</li>\n</ul>\n<p><strong>Nice to Have</strong></p>\n<ul>\n<li>BS, MS or PhD in Computer Science or related technical field</li>\n<li>Experience with information retrieval technologies (Elasticsearch, Lucene)</li>\n<li>Comfortable working with large datasets and designing systems able to process and scale up to large data volumes</li>\n<li>Familiarity with RESTful web services and microservices architectures</li>\n<li>Experience with MySQL, Redis, nginx, Zookeeper and other technologies in the Squirro stack</li>\n<li>Familiarity with AWS, Terraform, Prometheus, Grafana, Ansible and other DevOps related tools</li>\n<li>Awareness of machine learning as applied to text analysis</li>\n</ul>\n<p><strong>Working with Us</strong></p>\n<p>Squirro is a Swiss startup with an international flavour. Our team of passionate technology geeks and entrepreneurs mix local “Swissness” with American, German, French, Russian, Indian, Portuguese, Polish and British into an all-round startup team that combines the excellence of the ETH and EPFL with experience from technology companies such as Microsoft and Google as well as Swiss players such as local.ch and DeinDeal.</p>\n<p>We love Python and ElasticSearch on the server side and JavaScript, backbone.js, React, D3 and more on the client side. We work with git, believe in testing, code reviews, continuous integration and continuous deployment. Our work is structured loosely around scrum with help from Jira and the Atlassian tool suite. We take design and user experience seriously and apply machine learning in the context of text analysis.</p>\n<p>Most of all we’re serious about building a world-class company and our compensation package includes shares because we believe our employees should be rewarded for their hard work and dedication.</p>\n<p>Our engineering office is in the heart of Zürich, with easy access to public transport.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@squirro.com\">jobs@squirro.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6266702b8f37f4f3c34844bf46a138deb9b62729/728d2587-0eff-4cf3-bfc5-26581e0d58c2"
    },
    {
        "id": "2987d5fb-01e5-4d77-ad5c-f51820f87b51",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2987d5fb-01e5-4d77-ad5c-f51820f87b51",
        "created_at": "Wed Jul 10 15:16:34 UTC 2019",
        "company": "Avochato",
        "company_url": "https://www.avochato.com",
        "location": "San Francisco",
        "title": "Full Stack Developer",
        "description": "<h1>Who we are</h1>\n<p>Avochato is an enterprise mobile messaging company based in San Francisco, California. Consumers prefer to communicate with messaging platforms, but businesses are built for email. Avochato upgrades enterprises to messaging. Join us in developing a product that users love.</p>\n<h1>Your Role</h1>\n<p>As a Full Stack Developer you will collaborate closely with other members of the Product and Engineering teams to make new experiences come to life while addressing scalability and usability concerns on an iterative basis. On a given day at Avochato, you may:</p>\n<ul>\n<li>Develop new and existing data models, as well as intuitive web interfaces to display and manipulate those models at scale</li>\n<li>Submit and review pull requests on a daily basis</li>\n<li>Research and integrate the Avochato Platform with external APIs based on business needs</li>\n<li>Develop and document public-facing RESTful APIs on behalf of Avochato customers</li>\n<li>Collaborate with Customer Success and Product teams to solve complex business problems and debug new and existing regressions experienced by users</li>\n<li>Collaborate with other engineers to pragmatically update and maintain the Avochato Messaging API, mobile apps, and web dashboard with zero downtime.</li>\n</ul>\n<h2>Requirements:</h2>\n<h3>San Francisco / Bay Area on-site only. No remote options are available at this time.</h3>\n<h3>BS/BA or higher preferred but not required.</h3>\n<ul>\n<li>5+ Years production experience developing dynamic web applications using CSS3 &amp; HTML5 and an MVC framework</li>\n<li>3+ Years production experience using Ruby on Rails</li>\n<li>5+ Years production experience in collaboratively versioning and distributing code with Git</li>\n<li>5+ Years using a SQL in production</li>\n<li>3+ Years of cross-browser and mobile web experience including Chrome, Firefox, IE 8-11, Edge, Safari, Safari Mobile</li>\n<li>Strong communication skills, autonomous but comfortable asking for help</li>\n<li>Thirst for knowledge</li>\n</ul>\n<h2>Nice to have experience in any of the following:</h2>\n<ul>\n<li>PostGres</li>\n<li>SASS</li>\n<li>AWS (S3, Elastic Beanstalk, Cloudfront, Route53)</li>\n<li>React / React Native</li>\n</ul>\n<h1>What we're building</h1>\n<p>At Avochato, we believe customers are in the driver’s seat. Customers want the flexibility to communicate with businesses immediately and when they do, their experiences need to be personalized, instant, and always on. Facing increasing customer demands, sales, marketing, and customer support teams must rise to the occasion.</p>\n<p>Fortunately, Avochato makes it easy for all teams to connect with customers and deliver a seamless and efficient experience every step of the way from lead capture and nurturing to post-sale support. The result: you increase engagement with your customers to close more deals, faster than ever before.</p>\n<p>SMS is the most immediate, attention-grabbing, and cost-effective communication channel there is. It boasts the highest read rate of any channel – over 90 percent of all texts are read within three minutes of delivery. It is not a surprise, then, to see that businesses around the world are increasingly adopting text messaging for their communications.</p>\n<h1>Why You’ll Love Avochato</h1>\n<ul>\n<li>Everyone at Avochato is committed to making a positive impact above all else– as leaders we lead people to a better place, whether it’s a teammate, a customer, a customer’s customer, an investor, an advisor, a family member, or a friend-Avochato believes in personal growth, transparency, and a high degree of autonomy</li>\n<li>Customers (and employees) love our product. Check out our reviews on <a href=\"https://www.g2crowd.com/products/avochato/reviews\">G2 Crowd</a>, <a href=\"https://www.capterra.com/p/161117/Avochato/\">Capterra</a> and on <a href=\"https://www.glassdoor.com/Overview/Working-at-Avochato-EI_IE2386240.11,19.htm\">Glassdoor</a>\n</li>\n<li>Sales cycles are fast at Avochato, and we celebrate every win on a daily basis across all teams</li>\n<li>Employee referral bonuses to encourage the addition of great people to the team</li>\n<li>Medical, dental, and vision coverage for full-time employees, as well asa 401k plan</li>\n</ul>\n",
        "how_to_apply": "<p>Text GITHUB to +1(415)691-2455</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1ZyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--157979a0838aad75a333117ffd3bf4e6506d22f1/avochato-logo-vertical.png"
    },
    {
        "id": "9999f1f0-e448-11e8-966e-602e38acf303",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303",
        "created_at": "Fri Nov 09 21:36:14 UTC 2018",
        "company": "BlueVine",
        "company_url": "http://bluevine.com",
        "location": "Redwood City, Ca",
        "title": "Senior Python Developer",
        "description": "<p>At BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.</p>\n<p>We’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.</p>\n<p>As a <strong>Senior Python Developer</strong> at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.</p>\n<p><strong>BENEFITS &amp; PERKS:</strong></p>\n<ul>\n<li>Receive over $1,000 annually for a wellness benefit of your choice</li>\n<li>Free commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees</li>\n<li>Weekly catered lunches</li>\n<li>Unlimited snacks in fully stocked kitchens</li>\n<li>Generous PTO and holidays</li>\n<li>Excellent health coverage and life insurance benefits</li>\n<li>Generous, paid parental leave which covers up to 15 weeks</li>\n<li>Pet-friendly offices</li>\n</ul>\n<p><strong>WHAT YOU'LL DO:</strong></p>\n<ul>\n<li>Architect and build state-of-the-art web &amp; mobile application using a variety of languages and tools</li>\n<li>Build distributed backend application in the cloud</li>\n<li>Understand repeatable automated processes for building the application, test it, document it, and deploy it at scale</li>\n<li>A desire to work as part of a growing, fast-paced, and highly-flexible team</li>\n<li>Work closely with, and incorporate feedback from, product designers and other stakeholders in the company</li>\n<li>Be able to develop a project through its entire lifecycle</li>\n<li>Have strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines</li>\n<li>Provide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved</li>\n</ul>\n<p><strong>WHAT WE LOOK FOR:</strong></p>\n<ul>\n<li>Knowledge of Python (4+ years)</li>\n<li>Knowledge of Django (2+ years)</li>\n<li>Experience with Celery, RESTful APIs and server-side APIs integration</li>\n<li>Knowledge of ORM, SQL and Data Modeling</li>\n<li>Experience with TDD and ability to write quality unit tests</li>\n<li>Experience with AWS, cloud deployments, devops and web security</li>\n<li>Knowledge of JavaScript, HTML5, CSS3</li>\n<li>Ability to quickly learn new technologies and adapt to a fast-paced development environment</li>\n</ul>\n<p>BlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.</p>\n",
        "how_to_apply": "<p>[Senior Python Developer] (<a href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a>)</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"
    },
    {
        "id": "24c31152-e440-11e8-9240-8dede5d34cb0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0",
        "created_at": "Fri Nov 09 16:54:38 UTC 2018",
        "company": "Apple Inc.",
        "company_url": "http://www.apple.com",
        "location": "Cupertino, CA",
        "title": "Full Stack Engineer",
        "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n<p>Job Summary:</p>\n<ul>\n<li>Marcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.</li>\n<li>\n<a href=\"http://apple.com\">http://apple.com</a> is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.</li>\n</ul>\n<p>Key Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.</p>\n<p>Description:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability</p>\n<p>Manages expectations and provides ongoing status updates to team members.</p>\n<p>Responsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.</p>\n<p>Uses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,</p>\n<p>Ensures robust and lasting solutions are selected and embraced.</p>\n<p>Works under tight deadlines and keeps producers updated on an ongoing basis.</p>\n<p>Develops positive multi-functional relationships and works well with all levels of management.</p>\n<p>Provides solutions to complex problems in a concise and articulate way.</p>\n<p>Seen as the 'go to</p>\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n<p>REQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.</p>\n",
        "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\">Apply here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"
    },
    {
        "id": "fa55ec4a-dd65-11e8-867f-7944d54de916",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa55ec4a-dd65-11e8-867f-7944d54de916",
        "created_at": "Wed Oct 31 23:38:11 UTC 2018",
        "company": "Bio-Rad Laboratories",
        "company_url": "http://www.bio-rad.com",
        "location": "Pleasanton, CA",
        "title": "Backend Web Developer (Software Developer III Non-IT)",
        "description": "<p>Backend Web Developer (Software Developer III Non-IT)\nBio-Rad Laboratories</p>\n<p>Overview\nWho We Are and What We Do</p>\n<p>Bio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things). We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out</p>\n<p>What We Are Looking For</p>\n<p>A solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?</p>\n<p>Responsibilities</p>\n<ul>\n<li>Be one of the founding members of our new cloud data platform.</li>\n<li>Work in a collaborative environment to apply well architected solutions within this space.</li>\n<li>Architect complex business logic and features to add to our web based applications from concept to implementation.</li>\n<li>Work alongside Scientists, Marketing, and R&amp;D Engineers through the Product Development life cycle and beyond.</li>\n<li>Develop / Improve the core infrastructure for high scalability.</li>\n<li>Working with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.</li>\n</ul>\n<p>Qualifications</p>\n<ul>\n<li>5+ years’ experience as a Software Developer.</li>\n<li>Hands-on development experience with Python, Flask and Java in Linux environments.</li>\n<li>Have successfully built scalable APIs according to best practices.</li>\n<li>Experience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.</li>\n<li>Experience with Cloud Hosting (AWS preferred).</li>\n<li>Quick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.</li>\n<li>Experienced with test automation: TDD, unit/integration/functional testing.</li>\n<li>Experienced implementation efforts following an Agile software development lifecycle approach.</li>\n<li>Excellent communication skills, both written and verbal.</li>\n<li>A team-oriented contributor that aims to enhance the effectiveness of their colleagues.</li>\n</ul>\n<p>About Bio-Rad:</p>\n<p>Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.</p>\n<p>Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.</p>\n<p>EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age</p>\n<p>Agency Non-Solicitation:</p>\n<p>Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.</p>\n",
        "how_to_apply": "<p>For full application instructions and position description, visit <a href=\"http://apptrkr.com/1325674\">http://apptrkr.com/1325674</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"
    },
    {
        "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
        "created_at": "Wed Oct 31 19:45:06 UTC 2018",
        "company": "Traction",
        "company_url": "https://www.tractionco.com/",
        "location": "Sunnyvale, CA ",
        "title": "Lead Full Stack Developer",
        "description": "<p>The Job:</p>\n<p>Traction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.</p>\n<p>This role will see you leading a team of developers as well as being an individual contributor to the team.</p>\n<p>We’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.</p>\n<p>Must be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.</p>\n<p>Core Responsibilities:</p>\n<ul>\n<li>Act as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers</li>\n<li>Work closely with the development manager to ensure requirements and timelines are met</li>\n<li>Work closely with the development manager and back-end teams to architect and integrate front-end code</li>\n<li>Develop advanced applications with a mixture of third-party and proprietary tools and libraries</li>\n</ul>\n<p>Skills and Experience:</p>\n<ul>\n<li>Experience as a lead developer</li>\n<li>2+ years of experience building websites using HTML, CSS, and JavaScript</li>\n<li>8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)</li>\n<li>8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.</li>\n<li>8+ years of experience in modeling n-tier applications</li>\n<li>6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus</li>\n<li>Experience writing unit tests for web applications</li>\n<li>Experience with containers and container platforms (Docker, Mesos, Kubernetes)</li>\n<li>Experience in defining continuous integration build processes for front-end web development</li>\n<li>Familiarity with CI/CD strategy (AWS, Heroku, Google Cloud)/</li>\n<li>Knowledge of common design patterns in web development (i.e., MVC, MVVM)</li>\n<li>Working knowledge of source control software such as Git (preferred) or SVN</li>\n<li>Exposure to Agile project management methodologies</li>\n<li>Ability to multi-task and manage tasks with varying priorities</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and management</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Experience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning</li>\n<li>Willingness to learn new technologies and implement in short time</li>\n<li>Comfortable working in a multi-discipline, geographically dispersed team</li>\n<li>Experience in leading a team of developers through all processes of development and integration, including test automation</li>\n</ul>\n<p>Education: BA or BS in computer science or equivalent experience</p>\n<p>Extra Credit:</p>\n<ul>\n<li>Experience with e-commerce</li>\n<li>Knowledge of accessibility specifications</li>\n<li>Experience with GraphQL</li>\n<li>Experience with Scala</li>\n</ul>\n<p>Our humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.</p>\n<p>Will you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.</p>\n",
        "how_to_apply": "<p><a href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\">https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer</a></p>\n",
        "company_logo": null
    },
    {
        "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
        "created_at": "Fri Nov 02 19:02:51 UTC 2018",
        "company": "Jun Group",
        "company_url": "https://www.jungroup.com/",
        "location": "New York, NY",
        "title": "Senior Software Developer, Server-Side Technologies",
        "description": "<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events</li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/06736d9f2\">https://grnh.se/06736d9f2</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"
    },
    {
        "id": "cfc11293-327f-4e71-9c84-58c273d9911c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cfc11293-327f-4e71-9c84-58c273d9911c",
        "created_at": "Thu Sep 19 14:24:59 UTC 2019",
        "company": "TrialSpark",
        "company_url": "http://www.trialspark.com",
        "location": "New York",
        "title": "Senior Software Engineer - Product",
        "description": "<p><strong>Background</strong></p>\n<p>Before new medical treatments can be administered to the public, they must demonstrate safety and efficacy in a clinical trial. These trials protect consumers from ineffective and dangerous products, but the clinical trial process also presents a tremendous bottleneck in delivering life-saving treatments to patients.</p>\n<p>A typical trial involves coordinating between numerous parties and data formats to gather, store, analyse, and audit clinical data. Mistakes and delays are common, and fewer than 10% of trials finish on time. At TrialSpark, we are reimagining the clinical trial process from first principles, and building the technology platform for the trial of the future.</p>\n<p>So far, we’ve worked with treatments for Ebola, Depression, and HIV. Our reach is growing rapidly, and building a world class engineering team is core to achieving our mission.</p>\n<p><strong>Job Description</strong></p>\n<p>As a Senior Software Engineer, you will be responsible for designing, building, testing, securing, deploying, maintaining, and improving software applications for use both by internal TrialSpark employees and for external users. You will work with product managers, designers, and other functions of the business to help set priorities, scope technical work, coordinate changes, clarify and refine requirements, and set appropriate expectations. You are autonomous and self-driven, but can work effectively in a highly collaborative and team setting.</p>\n<p>Duties include but are not limited to:</p>\n<ul>\n<li>Design, develop, test, and deploy software for TrialSpark’s proprietary applications.</li>\n<li>Communicate with product management and operational stakeholders to determine requirements.</li>\n<li>Iterate and refine software development processes and best practices for software development, with the aim of producing high-quality and validated software.</li>\n<li>Address any bugs and errors in TrialSpark software applications in a timely way.</li>\n</ul>\n<p><strong>Relevant Experience</strong></p>\n<ul>\n<li>Minimum 4 years of experience in an agile software development environment.</li>\n<li>Knowledge of Python, TypeScript, JavaScript, SQL, database design.</li>\n<li>Familiarity with Linux-based operating systems, cloud technologies (AWS, Docker), and PostgreSQL database.</li>\n<li>Experience with debuggers, e.g. browser debuggers, pdb, PyCharm, etc.</li>\n<li>Strong technical understanding of web-based technologies.</li>\n<li>Exceptional communication skills with the ability to convey complicated systems to both technical and non-technical audiences.</li>\n<li>Proven track record of working with product management and shipping features to end users in a team environment.</li>\n<li>B.A./B.S. in Computer Science or a related field, or equivalent experience</li>\n</ul>\n<p><strong>Bonus points</strong></p>\n<p>If you’ve worked with React, Python, Redux, Flask, and SQLAlchemy</p>\n<p>You will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n",
        "how_to_apply": "<p>To apply - visit this <a href=\"https://grnh.se/50044ba41\">link</a>!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzF5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--51958ea89bb6c1dcc18bd3c403035172ec159fe7/_ts-black_wordmark.png"
    },
    {
        "id": "e3268c79-614c-4978-8f22-e6495c1e067f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e3268c79-614c-4978-8f22-e6495c1e067f",
        "created_at": "Wed Sep 04 19:54:29 UTC 2019",
        "company": "Stride Consulting",
        "company_url": "https://www.stridenyc.com/careers",
        "location": "New York City",
        "title": "Lead Software Development Consultant",
        "description": "<p><strong>Join our Family</strong></p>\n<p>Stride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’re in great company.</p>\n<p>Our goal is to leave our clients functioning at a higher level than when we found them.  We do this by writing high quality code alongside them, and by mentoring their developers, product teams and stakeholders in software development best practices.</p>\n<p>We believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.</p>\n<p><strong>As a Strider, you’ll find an unmatched opportunity. You will:</strong></p>\n<p>Be a senior member of an engineering-driven culture, one that is employee owned, has a 4.9 star Glassdoor review, and has won Crain’s Best Places to Work 2 years in a row.\nWrite high-quality code with some of the smartest engineers in town.\nMentor and manage a Stride team\nManage projects:\nCreate technical engagement strategy with Stride’s account team\nForm trust with client leadership\nHelp structure how the project is run, including Agile process and development/architecture decisions</p>\n<p><strong>Day In The Life of an Engineering Manager</strong></p>\n<p>You are empowered to define what work/life balance means to you. You’ll work onsite at your client in NYC. We are proud to call some of the most outstanding tech teams our clients.</p>\n<p>Your work week will involve 60%-80% client work (coding, managing a Stride team, and running the engagement). The rest of your time will be spent on strategic initiatives.</p>\n<p>A sample day:</p>\n<ul>\n<li>\n<p>9am: Weekly Sprint Planning.  Me and the client Product Owner co-run weekly sprint planning. We’ve got the meeting down to a nice rhythm. We walk away with a plan.</p>\n</li>\n<li>\n<p>10am: Daily Standup.</p>\n</li>\n<li>\n<p>10:10-12:30 Pair Programming. This morning, I’m pairing with another Strider, a mid-level engineer. She’s got strong fundamentals. We’re doing a deep dive into complex backend code. She’s driving, I’m asking questions when I see she gets stuck. She noticed inefficient code and we spent about 20 minutes refactoring.</p>\n</li>\n<li>\n<p>12:30-1:30 Lunch</p>\n</li>\n<li>\n<p>1:30-3:00 Pair Programming</p>\n</li>\n<li>\n<p>3:00-3:30 Mob programming  A team member gets stuck on a piece of code. I sit down with Jean and his pair. We call over 2 other developers and we mob program. We figure out a plan and everyone is excited about the collaboration.</p>\n</li>\n<li>\n<p>3:30-4:30 Mind Map Over the past two months, I’ve observed the team’s strengths and areas for improvement. Today, I’m leading a Mind Mapping session with the Striders. We visually organize areas for improvement. We prioritize each item by complexity and importance. Next Monday, I’m presenting this to the client CTO.</p>\n</li>\n<li>\n<p>4:30- 5: Code Review Today, one of the Striders was coding solo. So, I sit down and review her code.</p>\n</li>\n<li>\n<p>5-6: Stride U DevOps Jam Stride U is ongoing education for Striders by Striders. Seven of us are taking the DevOps Jam course now, it’s 1 hour weekly, for 8 weeks.  DevOps is something I’m dipping a toe in and having a safe space to learn real world stuff that I can bring back to my client is amazing.</p>\n</li>\n<li>\n<p>6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.</p>\n</li>\n</ul>\n<p><strong>About your job at Stride</strong></p>\n<p>Your job: write high quality code, and bring a ‘teach a team to fish’ mentality to your project. You will:</p>\n<ul>\n<li>Embed with tech teams in some of NYC’s most exciting startup, mid-market and enterprise companies to help them up their game and get stuff done.</li>\n<li>Mentor and manage both Strider and client teams on the value of software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement</li>\n<li>Be the reason your client teams are higher performing on your last day with them than they were on your first day.</li>\n<li>Lead and be part of a cross functional team of Striders and client employees.</li>\n<li>Work with, learn and teach others a variety of tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.</li>\n</ul>\n<p><strong>You’re a fit if you have:</strong></p>\n<ul>\n<li>6+ years of software development experience, including 1 year as a lead developer or manager</li>\n<li>Proficiency in multiple programming languages and ability to quickly gain proficiency in unfamiliar languages and frameworks</li>\n<li>Desire to guide team strategy</li>\n<li>Passion for seeing projects through from inception to deployment</li>\n<li>Experience teaching TDD, story estimation, test writing, and effective pair programming</li>\n</ul>\n<p><strong>What you can expect from us:</strong></p>\n<ul>\n<li>Continuous learning on things that you are passionate about</li>\n<li>Competitive Pay and Benefits (including Profit Sharing!)</li>\n<li>Empowerment to work at a self-defined sustainable pace</li>\n<li>Awesome culture</li>\n<li>No travel</li>\n<li>$2,000 and up to two weeks of your time for self-directed professional development</li>\n</ul>\n<p><strong>About Stride Consulting</strong></p>\n<p>Stride Consulting is NYC’s go-to Agile software development consultancy.</p>\n<p>Our mission: Teach the World to Stride! We believe that high functioning development teams give an organization a true competitive advantage. We help tech teams up their game, and become the highest functioning version of themselves in perpetuity.</p>\n<p>We do this by co-locating and literally coding side-by-side with our clients. We come to you. The love for technical mentorship weaves a thread through all that we do. We not only advocate for best practices in software development, we model the way. Our non-dogmatic Agile developers and product managers teach through doing, because we know that every tech team is unique in their challenges and opportunities.</p>\n<p>We are employee owned &amp; run, and profitable. This means we don’t have a board of directors to answer to or investors who need to make a return. We are in control of our growth and can do so at a pace that sustains our culture and  prioritizes the happiness of our employees.</p>\n",
        "how_to_apply": "<p>If interested, please visit the link below to apply: <a href=\"https://boards.greenhouse.io/stride/jobs/1342703\">https://boards.greenhouse.io/stride/jobs/1342703</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWh4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b05dfdb553ecacd9b3565dff9e5dbcefb66b4126/Stride%20Consulting%20Logo%20Below%202018.png"
    },
    {
        "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
        "created_at": "Sat Nov 10 02:02:55 UTC 2018",
        "company": "Sesame",
        "company_url": "http://sesamecare.com",
        "location": "New York; Berlin",
        "title": "Software engineer (back end)",
        "description": "<p>We’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.</p>\n<p>Our all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.</p>\n<p>We believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.</p>\n<p>We’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.</p>\n<p>We must be on to something, since we’re proud to say:</p>\n<ul>\n<li>We have engineering teams in New York and Berlin</li>\n<li>We've raised millions in funding to grow U.S. operations.</li>\n</ul>\n<p>Want to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.</p>\n<p><strong>About you:</strong></p>\n<ul>\n<li>Comfortable with Java and microservices.</li>\n<li>You seek and prefer simple solutions to complex problems.</li>\n<li>You strive to write clean, quality code and enjoy doing it.</li>\n<li>You maintain a healthy balance between perfectionism and actually getting stuff done.</li>\n<li>You either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.</li>\n<li>You love developing software. You have 2+ years of industry experience.</li>\n<li>You are a strong team player, have strong writing skills, and enjoy collaborating with others.</li>\n<li>You are attuned to the fundamentals of user design and user experience.</li>\n</ul>\n<p><strong>Our technology stack includes:</strong></p>\n<ul>\n<li>Java 10</li>\n<li>Spring Boot</li>\n<li>Kubernetes</li>\n<li>Docker</li>\n<li>GraphQL</li>\n<li>Pub/Sub</li>\n<li>Postgres</li>\n<li>Python</li>\n<li>NodeJs</li>\n</ul>\n<p><strong>Our Offer:</strong>\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.</p>\n<p><strong>Perks:</strong>\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.</p>\n<p>Sesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
    },
    {
        "id": "3230ac37-443e-4968-86d6-10b4e4b9eb21",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3230ac37-443e-4968-86d6-10b4e4b9eb21",
        "created_at": "Fri Sep 20 13:18:52 UTC 2019",
        "company": "Issuu.com",
        "company_url": "http://Issuu.com",
        "location": "Palo Alto",
        "title": "Integration Engineer",
        "description": "<p>At Issuu, we empower content creators through cutting edge tools, technology and services. We exist to help creators of longform, highly visual content build audiences and businesses. We're looking for a Fullstack Developer to join our ride as Integration Engineer.</p>\n<p>We are the right company for you, if you</p>\n<ul>\n<li>want to work on a product that matters to a lot of people</li>\n<li>We receive hundreds of visits per second - and host over 50M+ publications,</li>\n<li>consider yourself one of the best at what you do and you're looking for equally talented colleagues,</li>\n<li>are self-driven and would never just want to take the next ticket,</li>\n<li>are curious and never stopped learning and exploring new languages, technologies and solutions,</li>\n<li>seek a culture where all voices matter when it comes to shaping the future of the product,</li>\n<li>want to work with colleagues who have ‘here to help’ attitude, and absolutely want to help you succeed.</li>\n</ul>\n<p>We believe you can help us succeed by being responsible for</p>\n<ul>\n<li>supporting outbound marketing activities as required such as: active blogging, conference presentation, technical-paper development, and article placement,</li>\n<li>supporting the PM in making sure the product demo is updated and running,</li>\n<li>creating and documenting product demonstration setups,\ndelivering demonstrations to partners and customers and at conferences,</li>\n<li>work with the PM in presenting concepts, prototypes, wireframes, demos and the technical processes to internal and external audiences,</li>\n<li>prototyping integrations with third party platforms, products, APIs,</li>\n<li>supporting Product Development with insights gained from interactions with partners and customers,\ndeveloping technical documents, training guides, and presentations for internal and external use.</li>\n</ul>\n<p>We are looking for someone who has</p>\n<ul>\n<li>a Bachelor’s degree in CS or equivalent,</li>\n<li>experience presenting at conferences, meetups, and pitch meetings,</li>\n<li>an ability to self-direct and solve problems with minimal input,</li>\n<li>experience with Functional Programming (E.g. OCaml, Erlang),</li>\n<li>has worked on 2+ large scale commercial projects taken from inception to production,</li>\n<li>experience with dynamically typed systems (e.g. Python, Javascript, Erlang),</li>\n<li>experience with C/C++ or other low-level languages with manual memory management,</li>\n<li>experience with scalable microservice architecture,</li>\n<li>the ability to work on any system, from code running in the browser to big data analytics dealing with - terabytes of data,</li>\n<li>strong competence in building user interfaces,</li>\n<li>an ability to travel domestically and abroad,</li>\n<li>excellent communication skills in English.</li>\n</ul>\n<p>Can you say yes to most of these qualifications? If you want to join a great team and work on something that matters, it’s time to apply!</p>\n<p>Would You Like to Join?\nThis is the perfect opportunity to join a multinational company and being able to leave your mark on processes and procedures that impacts everyone at Issuu. You will get the opportunity to travel to our CPH office as part of your onboarding and hereafter as agreed upon in your team.</p>\n<p>In our Palo Alto office, you’ll find members from all parts of Issuu, including Product, Design, Customer Success, Data Analytics, Marketing, BD and Management. We are conveniently close to the Palo Alto Caltrain Station and provide delicious catered lunches, regular outings, healthy drinks and snacks, and a friendly, creative, welcoming atmosphere in a cool office set-up. As if that wasn’t enough, we offer a state of the art health benefits, amazing colleagues, and a flexible working environment.</p>\n<p>Details: A valid US work permit is required.</p>\n<p>Dig deeper.\nMost of our content creators are on a mission to change their world in some way. They are passionate and driven and we consider ourselves the same. Check some of them out:</p>\n<p>The avantgarde Italian kids fashion magazine: <a href=\"https://issuu.com/kidswearmagazine\">https://issuu.com/kidswearmagazine</a></p>\n<p>The San Francisco Opera magazine: <a href=\"https://issuu.com/sanfranciscoopera\">https://issuu.com/sanfranciscoopera</a></p>\n<p>The Danish outdoor garage start-up magazine: <a href=\"https://issuu.com/outsite.org\">https://issuu.com/outsite.org</a></p>\n<p>The Polish/Irish photographer: <a href=\"https://issuu.com/thefix-analogue-magazine\">https://issuu.com/thefix-analogue-magazine</a></p>\n<p>The American Meteorite Exchange Inc. Magazine: <a href=\"https://issuu.com/meteorite-times\">https://issuu.com/meteorite-times</a></p>\n<p>We encourage everyone to apply regardless of race, religion, color, national origin, gender, sexual orientation, age, marital, veteran or disability status.</p>\n",
        "how_to_apply": "<p>Please submit your application through this link: <a href=\"https://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea\">https://jobs.lever.co/issuu/0d2686cc-75af-4160-a89e-0044bd0ac7ea</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3h5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe847ec67b3b620949c364ff898352190271d00/issuu-logo-stacked-colour.jpg"
    },
    {
        "id": "092c5660-bd5c-484f-96fe-0d9796e87031",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/092c5660-bd5c-484f-96fe-0d9796e87031",
        "created_at": "Thu Sep 19 21:48:28 UTC 2019",
        "company": "LeapYear",
        "company_url": "https://leapyear.ai/careers",
        "location": "San Francisco",
        "title": "Haskell Engineer at LeapYear - Core Platform",
        "description": "<h2>What we do</h2>\n<p>LeapYear's secure machine learning platform is deployed by some of the largest enterprises in the world across finance, healthcare, and technology.</p>\n<p>Our technology ensures differential privacy, a widely recognized standard of data privacy that enables all data - including sensitive information - to be utilized for analytics, while providing mathematically proven privacy protection.</p>\n<p>The LeapYear system is composed of a core set of components that allow private machine learning on data sets that can scale to petabytes. The system includes private algorithms for relational operations, statistical methods and machine learning. A data scientist accesses private data using a Python API. Administration is provided  via a web-based GUI or an API.</p>\n<p>LeapYear's platform team builds the services that allow our product to integrate with complex enterprise environments and operate effectively on our customers’ most sensitive data.</p>\n<p>The platform includes services for authentication, access control, logging, auditing  and support for integration of data from a variety of data sources including SQL/NoSQL Databases, HDFS and S3. Queries are processed using Spark to support to enable fast, distributed processing  of massive data sets. The services are primarily written in Haskell, with Python, Scala, and Java used as additional supporting languages.</p>\n<p>We are looking for platform engineers that have a track record of developing enterprise-ready features for technical end users, including enterprise integrations, rigorous security, flexible deployment, and support for diverse data sources.</p>\n<h2>Recent technical challenges we've been working on</h2>\n<ul>\n<li>Developing a Spark-based query engine with strong typechecking.</li>\n<li>Achieving terabyte and petabyte scale on Spark.</li>\n<li>Refactoring our persistence layer.</li>\n<li>Using Haskell to implement enterprise-ready subsystems for authentication, permissioning, job management, and logging.</li>\n<li>Extending the platform to support automated daily data updates.</li>\n</ul>\n<p>For details on the specific responsibilities and requirements of this role, please see below.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Develop greenfield systems and scale existing services to support internet-scale deployments.</li>\n<li>Own the full software development lifecycle - problem definition, design, development, testing, demoing, and supporting production use of the features you own.</li>\n<li>Partner with product management to define problems and identify iterative solutions</li>\n<li>Balance immediate business objectives against long-term architectural vision</li>\n<li>Contribute to an engineering-wide culture of code quality and shared responsibility for testing</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>5+ years of professional experience writing production code</li>\n<li>Acquainted with and interested in functional programming (Haskell, OCaml, Clojure, Erlang, Scala)</li>\n<li>Track record of delivering high-quality product features on schedule</li>\n</ul>\n<h2>Preferred</h2>\n<ul>\n<li>Experience developing for on-premise enterprise deployments</li>\n<li>Professional experience with functional programming</li>\n<li>Prior experience developing production-level Spark applications or machine learning platforms</li>\n<li>Experience with ODBC/JDBC databases, AWS, CircleCI</li>\n<li>Lifelong learners and mentors</li>\n</ul>\n<h2>A Few of the Perks</h2>\n<ul>\n<li>Culture of teaching and learning</li>\n<li>Competitive compensation package of salary and equity</li>\n<li>Catered lunch every day</li>\n<li>Company outings</li>\n<li>Build your ideal work station</li>\n<li>Generous health insurance plan</li>\n<li>Relocation support and visa sponsorship</li>\n</ul>\n",
        "how_to_apply": "<p>Submit an application at <a href=\"https://leapyear.ai/careers\">https://leapyear.ai/careers</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUZ5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--53d46724c12970a933bdb01988af00e6b043b39e/LeapYear%20Logo%20Transparent%20Black%20cropped.png"
    },
    {
        "id": "83ac3dae-577b-4027-bfa4-fd58d4ca12ce",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/83ac3dae-577b-4027-bfa4-fd58d4ca12ce",
        "created_at": "Fri Sep 13 16:43:56 UTC 2019",
        "company": "Lawrence Berkeley National Laboratory (LBNL)",
        "company_url": null,
        "location": "Berkeley",
        "title": "Staff Systems Administrator 3 ",
        "description": "<p>Staff Systems Administrator 3 - 87840\nOrganization: AL-Advanced Light Source</p>\n<p>Berkeley Lab has an opening for a Systems Administrator at the Advanced Light Source</p>\n<p>Berkeley Lab’s Advanced Light Source (ALS, <a href=\"https://als.lbl.gov/\">https://als.lbl.gov/</a>) needs a Systems Administrator to lead the ALS IT team and manage the ALS computing infrastructure. The Systems Administrator will work closely with ALS operations, computing and controls staff with a high level of autonomy.  The ideal candidate will have in-depth technical knowledge of operating systems, networking, security, and data center management. As the primary IT representative for the ALS, this position will also collaborate with other divisions on projects of significant scope - potentially affecting IT policy for the greater LBL community.</p>\n<p>The ALS is a dynamic national scientific user facility that provides thousands of scientists from around the world access to bright beams of x-rays, infrared, and extreme ultraviolet light for scientific studies and technology development in disciplines spanning physical, chemical, materials, biological, energy, and Earth sciences. The ALS has been a global leader in soft x-ray science for more than two decades and is currently undertaking a new project (ALS-U, <a href=\"https://als.lbl.gov/als-u/overview/\">https://als.lbl.gov/als-u/overview/</a>) that will endow the facility with state-of-the-art x-ray capabilities. It's an exciting time to join our growing team!</p>\n<p>The core values of the ALS reflect a strong commitment to diversity, equity, and inclusion. We seek candidates who will support a culture in which the entire ALS community feels welcomed and valued.</p>\n<p>What You Will Do:\n• Manage ALS computing infrastructure, provide guidance and expert consultation to Linux, network, and security groups.\n• Act as ALS IT liaison to departments within the IT Division and direct and coordinate projects of complex scope involving network architecture, virtual infrastructure, and storage systems.\n• Administer ALS Active Directory domain: develop and set domain policy, create user and computer accounts. Troubleshoot complex AD issues such as authentication problems or domain controller synchronization failures.\n• Maintain and manage virtual infrastructure. Create and administer virtual machines for various functions such as web servers, desktop applications, or virtual control room consoles. Automate routine tasks using a scripting language such as Python or PowerShell. Perform server upgrades and provide architectural improvements.\n• Maintain Nagios monitoring infrastructure. Develop plugins and scripts to extend capabilities. Provide training to Operations staff on usage.\n• Stay up to date on the latest technologies and implement where appropriate; use knowledge to recommend and develop new, creative solutions.\n• Provide end-user computer support\n• Support accelerator operations: test controls &amp; computer systems during startup and tune periods; provide control room application support; off hours IT support as needed.\n• Manage desktop and rack-installed computers.  This includes configuring access control, patch management, custom group policies, and other administrative functions.\n• Collaborate with other divisions and IT departments on projects, develop best practices regarding IT policy.\n• Manage ALS server rooms - deal with cooling, electrical, and safety issues associated with data center management. Approve and manage server layout within racks. Hold training sessions for staff as required for access.\n• Supervise systems administrator and student(s). Provide growth opportunities and handle escalated issues. Backup as needed during absences.</p>\n<p>What is Required:\n• Bachelor’s Degree and a minimum of 8 years related experience in IT or equivalent experience.\n• Demonstrated ability to perform work with a minimum of supervision.\n• In-depth knowledge of Windows and Linux platforms and knowledge of Mac OS X. Well-versed in cross-platform issues.\n• Familiarity with VM infrastructure systems such as VMWare, Hyper-V, Proxmox, etc.\n• Significant knowledge of Microsoft technologies including Windows Server 2012 R2, Active Directory, Hyper-V, Failover Clustering. Experience managing Active Directory domains including GPO development and understanding trust relationships.\n• Strong written and interpersonal communication skills; ability to interact positively with a variety of colleagues.\n• Ability to lift and move equipment associated with desktop and server systems.</p>\n<p>Additional Desired Qualifications:\n• Experience in a supervisory role.\n• Knowledge of Nagios monitoring system, proven ability to write plugins and customize system.\n• Programming and/or scripting experience (PowerShell, Bash, Python, C/C++).\n• In-depth knowledge of computer hardware including standard Mac/PC components, rack mount server hardware.\n• Knowledge of enterprise storage systems such as Netapp.\n• Strong understanding of RAID concepts and RAID levels.\n• Strong knowledge of TCP/IP and OSI model, related protocols.\n• Experience with data center management including rack layout, power management and cooling requirements.\n• Knowledge of computer security principles; defense in depth, common attack vectors and mitigations.\n• Knowledge of control systems, data acquisition and data analysis devices.\n• Experience performing packet analysis with Wireshark/tcpdump.\n• Familiarity with EPICS and real time systems.\n• Previous experience in a 24/7 research environment.\n• MCSE Certified.\n• Apple certifications, ACMT and/or ACSP.</p>\n<p>The posting shall remain open until the position is filled, however for full consideration, please apply by close of business on September 30, 2019.</p>\n<p>Notes:\n• This is a full time career appointment.\n• Full-time, M-F, exempt (monthly paid) from overtime pay.\n• This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\n• Work will be primarily performed at: Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.</p>\n<p>How To Apply\nApply directly online at <a href=\"http://50.73.55.13/counter.php?id=169046\">http://50.73.55.13/counter.php?id=169046</a> and follow the on-line instructions to complete the application process.</p>\n<p>Learn About Us:\nBerkeley Lab (LBNL, <a href=\"http://www.lbl.gov/\">http://www.lbl.gov/</a>) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.</p>\n<p>Working at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Berkeley Lab- Click Here (<a href=\"https://hr.lbl.gov/\">https://hr.lbl.gov/</a>).</p>\n<p>Equal Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision under 41 CFR 60-1.4 (<a href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\">https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html</a>).  Click here (<a href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\">http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf</a>) to view the poster: \"Equal Employment Opportunity is the Law\".</p>\n",
        "how_to_apply": "<p>Apply directly online at <a href=\"http://50.73.55.13/counter.php?id=169046\">http://50.73.55.13/counter.php?id=169046</a> and follow the on-line instructions to complete the application process.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHB5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8db97f7be72672faf5b21ce1f39dcf491c9996e0/Lawrence%20Berkeley%20Lab%20blue%20background.png"
    },
    {
        "id": "66746c7b-7200-4b7b-825c-4f06d80032cf",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/66746c7b-7200-4b7b-825c-4f06d80032cf",
        "created_at": "Mon Sep 02 16:30:14 UTC 2019",
        "company": "NinthDecimal",
        "company_url": null,
        "location": "Mountain View, CA, US",
        "title": "Platform Engineer",
        "description": "<p>About NinthDecimal:</p>\n<p>NinthDecimal is the omni-channel marketing platform powered by location data. We’re building a precise understanding of consumer behavior by connecting their digital and physical lives, helping marketers solve some of their biggest market opportunities. Our unique understanding of today’s consumer is built on a strong legacy of innovation and a customer intelligence platform that has been market tested by the world’s leading brands.</p>\n<p>NinthDecimal provides audience data, activation solutions, measurement, and insights across all media, empowering marketers to succeed in today’s omni-channel and data-driven world.</p>\n<p>Job Description</p>\n<p>We are looking for a Platform Engineer that will focus on enhancing a data driven business NinthDecimal. As a Platform Engineer, you should be a quick learner, enthusiastic about learning new technologies. You will implement technical solutions to empower internal/external customers and scale the existing platform. You will work closely with business owners to develop and define key business questions, then work with Data Scientist to build the data sets that answer those questions. You will work with huge data sets and build ETLs and analytic platform to bring datasets together to answer business questions, reporting and drive growth. This job is in our Chicago office.</p>\n<p>The responsibilities for this position include these activities:</p>\n<ul>\n<li>Design and implementation of the data driven initiatives at NinthDecimal such as Big Data analytics application development and architecture using Spark, Hadoop</li>\n<li>Understanding business requirements and converting them to technical solutions. Create ETLs to take data from various upper stream locations and create a unified dimensional or star schema data model for analytics and reporting.</li>\n<li>Collaborates with Data Scientist team to transform data and integrate algorithms and models into automated processes.</li>\n<li>Collaborate with Devops and Operation team to setup highly distribute, large scale and high performance platform systems</li>\n<li>Collaborate with other Backend engineers to formulate innovative solutions to experiment and implement advanced data algorithms</li>\n<li>Communicate complex concepts and the results of the analyses in a clear and effective manner to Product Owners</li>\n</ul>\n<p>Qualifications Required:</p>\n<ul>\n<li>Background in SQL</li>\n<li>Strong coding skills in Java, Python</li>\n<li>Experiences in Scala strong plus</li>\n<li>Experience with Big Data Technologies such as Hadoop, Spark, Hive.</li>\n<li>Experience in dealing with hundreds of Tetabytes of data strong plus</li>\n<li>Experience with building and optimizing large scale and high performance systems</li>\n<li>Knowledge in Mesos, Yarn, Kubernetes, Docker, Airflow, Luigi</li>\n<li>Strong collaboration and communication skills within and across teams.</li>\n<li>B.S. or M.S. in Computer Science or a related field</li>\n<li>Familiarity with the digital media / advertising industry is a big plus</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jsco.re/332a6\">https://jsco.re/332a6</a></p>\n",
        "company_logo": null
    },
    {
        "id": "915da959-4e4b-467b-86fd-6c11db944480",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/915da959-4e4b-467b-86fd-6c11db944480",
        "created_at": "Mon Sep 02 16:28:47 UTC 2019",
        "company": "NinthDecimal",
        "company_url": null,
        "location": "San Francisco, CA, US",
        "title": "Platform Engineer",
        "description": "<p>About NinthDecimal:</p>\n<p>NinthDecimal is the omni-channel marketing platform powered by location data. We’re building a precise understanding of consumer behavior by connecting their digital and physical lives, helping marketers solve some of their biggest market opportunities. Our unique understanding of today’s consumer is built on a strong legacy of innovation and a customer intelligence platform that has been market tested by the world’s leading brands.</p>\n<p>NinthDecimal provides audience data, activation solutions, measurement, and insights across all media, empowering marketers to succeed in today’s omni-channel and data-driven world.</p>\n<p>Job Description</p>\n<p>We are looking for a Platform Engineer that will focus on enhancing a data driven business NinthDecimal. As a Platform Engineer, you should be a quick learner, enthusiastic about learning new technologies. You will implement technical solutions to empower internal/external customers and scale the existing platform. You will work closely with business owners to develop and define key business questions, then work with Data Scientist to build the data sets that answer those questions. You will work with huge data sets and build ETLs and analytic platform to bring datasets together to answer business questions, reporting and drive growth. This job is in our Chicago office.</p>\n<p>The responsibilities for this position include these activities:</p>\n<ul>\n<li>Design and implementation of the data driven initiatives at NinthDecimal such as Big Data analytics application development and architecture using Spark, Hadoop</li>\n<li>Understanding business requirements and converting them to technical solutions. Create ETLs to take data from various upper stream locations and create a unified dimensional or star schema data model for analytics and reporting.</li>\n<li>Collaborates with Data Scientist team to transform data and integrate algorithms and models into automated processes.</li>\n<li>Collaborate with Devops and Operation team to setup highly distribute, large scale and high performance platform systems</li>\n<li>Collaborate with other Backend engineers to formulate innovative solutions to experiment and implement advanced data algorithms</li>\n<li>Communicate complex concepts and the results of the analyses in a clear and effective manner to Product Owners</li>\n</ul>\n<p>Qualifications Required:</p>\n<ul>\n<li>Background in SQL</li>\n<li>Strong coding skills in Java, Python</li>\n<li>Experiences in Scala strong plus</li>\n<li>Experience with Big Data Technologies such as Hadoop, Spark, Hive.</li>\n<li>Experience in dealing with hundreds of Tetabytes of data strong plus</li>\n<li>Experience with building and optimizing large scale and high performance systems</li>\n<li>Knowledge in Mesos, Yarn, Kubernetes, Docker, Airflow, Luigi</li>\n<li>Strong collaboration and communication skills within and across teams.</li>\n<li>B.S. or M.S. in Computer Science or a related field</li>\n<li>Familiarity with the digital media / advertising industry is a big plus</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jsco.re/3329z\">https://jsco.re/3329z</a></p>\n",
        "company_logo": null
    },
    {
        "id": "e7c85657-d537-439c-a983-0b9078585151",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e7c85657-d537-439c-a983-0b9078585151",
        "created_at": "Thu Aug 29 21:07:08 UTC 2019",
        "company": "Parametric Portfolio Associates",
        "company_url": "https://www.parametricportfolio.com/",
        "location": "800 5th Avenue, Suite 2800, Seattle, WA 98104",
        "title": "Automation Specialist",
        "description": "<p>At Parametric, we offer competitive salaries, generous benefits and opportunities for growth and development. We invite you to explore our available job opportunities listed below and look forward to having you become a part of our continued success!</p>\n<p>General Description</p>\n<p>The Automation Specialist updates and maintains the system that automates file delivery, data transformation, encryption, and integration with various software platforms.   They create new and modify existing process automation as requested by the business and are fluent in various scripting languages such as Python, PowerShell, and VBA/VBS.  They maintain data integrity, documentation, and source control as well as the Automation infrastructure and provide monitoring and failure support.  The Automation Specialist will also participate in larger, project-based technology initiatives.</p>\n<p>Primary Responsibilities</p>\n<p>● Creates, updates, and maintains process Automation as requested by the business\n● Performs business analysis of new requests\n● Creates, Updates, and maintains process documentation and self-help knowledge base\n● Works with various business owners to prioritize requests and communicate status</p>\n<p>Job Requirements</p>\n<p>● 3+ years of IT-Related experience (Scripting/Support/Helpdesk, etc.)\n● 2+ years Enterprise level scripting experience (Python, PowerShell, VBA/VBS, and/or Perl)\n● Experience with source control (Github)\n● College degree and financial industry experience preferred\n● Experience with Windows 7 - 10 and Server 2008-2019 operating systems\n● Experience with Helpdesk and change management systems/processes\n● Experience with Office 2010/2013 with a focus on Excel macros\n● Ability to present complex technical information in a clear, concise manner and to communicate with a variety of audiences, including non-technical users\n● Ability to work outside of normal business hours (early mornings, evenings, weekends) on a rotating basis\n● Maintain a professional demeanor and perform duties in an honest and ethical manner</p>\n<p>Apply Here: <a href=\"https://eatonvance.wd5.myworkdayjobs.com/en-US/Parametric/job/Seattle-WA-Office/Automation-Specialist_JR003292\">https://eatonvance.wd5.myworkdayjobs.com/en-US/Parametric/job/Seattle-WA-Office/Automation-Specialist_JR003292</a></p>\n<p>Parametric is an equal opportunity employer and is committed to providing a work environment that is free of discrimination and harassment.  It does not discriminate against applicants or employees with respect to any terms or conditions of employment on account of race, color, religion, creed, national origin, ancestry, sex, sexual orientation, age, pregnancy, parenthood, physical or mental disability (actual or perceived), medical condition including genetic characteristics, marital status, citizenship status, military service, gender, gender identity or express, registered domestic partner status, domestic violence victim status, status with regard to public assistance, or any other characteristic protected by applicable federal, state or local laws.  Parametric also prohibits discrimination based on the perception that a person has any of those characteristics or is associated with a person who has or is perceived as having any of those characteristics.  This commitment applies to all persons involved in the operations of Parametric, and prohibits unlawful discrimination by any employee of Parametric, including supervisors and co-workers.  All employment decisions shall be consistent with the principles of equal employment opportunity.</p>\n<p>The information on this website is for U.S. residents only and does not constitute an offer to sell, or a solicitation of an offer to purchase, securities in any jurisdiction to any person to whom it is not lawful to make such an offer. Investing entails risks and there can be no assurance that Parametric (and its affiliates) will achieve profits or avoid incurring losses. All investments are subject to potential loss of principal. Parametric does not provide tax or legal advice. Prospective investors should consult with a tax or legal advisor before making any investment decision. Please refer to the disclosure page for important information about investments and risks.</p>\n",
        "how_to_apply": "<p>Please Apply on the Parametric Careers Page: <a href=\"https://eatonvance.wd5.myworkdayjobs.com/en-US/Parametric/job/Seattle-WA-Office/Automation-Specialist_JR003292\">https://eatonvance.wd5.myworkdayjobs.com/en-US/Parametric/job/Seattle-WA-Office/Automation-Specialist_JR003292</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFZ3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a8fc2a5a52250340af360bb4829c730b1dd0cee5/Parametric%20Logo.png"
    },
    {
        "id": "fa45a40c-e77e-11e8-8888-30684bb94b56",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa45a40c-e77e-11e8-8888-30684bb94b56",
        "created_at": "Tue Nov 13 20:06:53 UTC 2018",
        "company": "Agilent",
        "company_url": "http://Agilent",
        "location": "Santa Clara, CA",
        "title": "Senior Algorithm Software Developer ",
        "description": "\n",
        "how_to_apply": "<p><a href=\"https://recruiting.adp.com/srccar/public/RTI.home?c=2167807&amp;d=External&amp;r=5000354052006#/\">https://recruiting.adp.com/srccar/public/RTI.home?c=2167807&amp;d=External&amp;r=5000354052006#/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1a97a17a5a4f1abb222a19e01420242c1a567e84/746d1726-15c6-4046-961e-bfd02e4ed2a0"
    },
    {
        "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
        "created_at": "Tue Nov 06 20:19:44 UTC 2018",
        "company": "Cortex Building Intelligence",
        "company_url": "https://cortexintel.com/",
        "location": "New York, NY",
        "title": "Software Engineer, Full Stack (Rails, React)",
        "description": "<p><strong>Company Description</strong></p>\n<p>Cortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).</p>\n<p><strong>Job Description</strong></p>\n<p>At Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Creating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.</li>\n<li>Integrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.</li>\n<li>Working closely with our Customer Success team to support client onboarding and operations.</li>\n<li>Taking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.</li>\n<li>Strong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.</li>\n<li>Experience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.</li>\n<li>Product-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.</li>\n<li>Excellent verbal and written communication skills.  Committed, hard-working, and thoughtful.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.</li>\n<li>Unlimited paid time off.</li>\n<li>Your choice of 13” or 15” Macbook Pro.</li>\n<li>Work in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.</li>\n</ul>\n",
        "how_to_apply": "<p>Schedule a time to chat with our CTO, Justin Spradlin: <a href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\">https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
    },
    {
        "id": "1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1ee011f0-dcbf-11e8-8f6b-cc4dc5b4578d",
        "created_at": "Wed Oct 31 03:43:54 UTC 2018",
        "company": "Petal",
        "company_url": "https://www.petalcard.com/",
        "location": "New York City",
        "title": "Senior Software Engineer",
        "description": "<p>Petal is the first credit card for people without a credit history. We analyze cashflow from applicants' bank accounts to evaluate credit quality, which enables us to provide credit to populations traditionally excluded from financial services.</p>\n<p>As a Senior Software Engineer, you'll architect, design, and implement major sub-systems across our platform.</p>\n<p>What you'll do</p>\n<p>Lead projects and provide technical leadership in subject matter expertise.\nOwn large portions of the code base.\nDesign secure and highly reliable services to integrate with our data and credit card processing partners.\nBuild frameworks and products which will be used by other engineering teams at Petal.\nWrite tests and constantly seek to improve code quality and reliability.\nBring positive energy to every meeting and make your colleagues feel included and heard.</p>\n<p>Experience</p>\n<p>You've demonstrated your ability to build, test, release, and maintain complex products.\nYou demand high-quality code of yourself and others.\nYou love trying new tools, technologies, and frameworks, but are pragmatic—you get stuff done with what solves the problem you’re facing.\nYou love shipping new things rapidly and iterating based on real user behaviour. You have a knack for finding and eliminating inefficiency in your users’ workflows.\nYou’re enthusiastic about unit testing and performance, and knowing how to communicate the value of technical excellence to non-technical teammates.\nYou’re a great listener, but are willing to speak up when you see something that needs to be fixed. You ask questions when something isn’t clear.</p>\n<p>Understanding that smart, hungry people can rapidly learn new technologies, here is our tech stack: <a href=\"https://stackshare.io/petal\">https://stackshare.io/petal</a></p>\n",
        "how_to_apply": "<p>Email your LinkedIn profile to <a href=\"mailto:nathan@petalcard.com\">nathan@petalcard.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--141ec03885a07949373c47fc21d75fe420c3ab16/54a97145-8c66-4c73-aeb7-1f261a002122"
    },
    {
        "id": "1639d216-ea0c-4078-8c5b-1a5b29d3c28b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1639d216-ea0c-4078-8c5b-1a5b29d3c28b",
        "created_at": "Tue Sep 24 17:13:39 UTC 2019",
        "company": "LeanData",
        "company_url": "https://www.leandatainc.com/",
        "location": "Sunnyvale",
        "title": "Software Engineer",
        "description": "<p><strong>Are you excited about working with a world-class team to build market-leading SaaS products that accelerate revenue for some of the world’s biggest brands?</strong></p>\n<p>As a Software Engineer at LeanData, you’ll be using your creative, collaborative and engineering skills to develop new products and features for our Salesforce.com SaaS application. You’ll be working in a fast-paced, high-growth environment as key member of our engineering team.</p>\n<p>We're looking for engineers who love to take on responsibility and bring unique ideas to challenging projects.</p>\n<p><strong>Responsibilities (what you’ll be doing):</strong></p>\n<ul>\n<li>Collaborate to develop new products and features for our Salesforce.com SaaS application</li>\n<li>Design and develop a processing platform using various configuration management technologies.</li>\n<li>Test software development methodology in an agile environment.</li>\n<li>Provide ongoing maintenance, support and enhancements in existing systems and platforms.</li>\n<li>Collaborate cross-functionally with business users, project managers and other engineers</li>\n<li>Provide recommendations for continuous improvement.</li>\n<li>Work alongside other engineers on the team to consistently apply best practices.</li>\n</ul>\n<p><strong>Qualifications (What you’ll need to have):</strong></p>\n<ul>\n<li>Knowledge of some or all of the following: Java, SQL, Salesforce Apex, Javascript, jQuery, Angular</li>\n<li>Willingness to learn new technologies that will give the company a competitive edge·</li>\n<li>Thrive in a fast-paced environment in a rapidly growing startup·</li>\n<li>Passion for coding demonstrated in your work and side projects·</li>\n<li>Ability to understand customer needs and translate those into software features</li>\n<li>Ability to work in Sunnyvale on a daily basis</li>\n</ul>\n<p><strong>About you (we’d like you to have):</strong></p>\n<ul>\n<li>1+ years of experience</li>\n<li>Experience in a start-up environment,</li>\n</ul>\n<p><strong>At this time, we are unable to provide visa sponsorship.</strong></p>\n<p><strong>About LeanData:</strong></p>\n<p>LeanData provides the market’s leading Revenue Ops platform enabling high-growth B2B companies to improve the buyer experience and accelerate time to revenue. As the leader in Lead-to-Account Matching, Routing and Marketing Attribution solutions, LeanData stands at the center of CRM, connecting the right data to the right people at the right time across the go-to-market process.</p>\n<p><strong>Why work at LeanData:</strong></p>\n<ul>\n<li>LeanData covers employee insurance premiums up to 90%.</li>\n<li>Unlimited PTO</li>\n<li>10 company holidays</li>\n<li>Commuter benefits for Caltrain</li>\n<li>Laptop vesting program</li>\n<li>Snacks and drinks provided daily</li>\n<li>401K plan</li>\n</ul>\n<p><em>We warmly welcome into the LeanData family all persons without regard to ethnic and racial identity, indigenous heritage, national origin, religion, gender, gender identity, gender expression, sexual orientation, age, disability, marital status, veteran status, genetic information, or any other legally protected status.</em></p>\n",
        "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/leandatainc/view/P_AAAAAACAAA8JDAY20BToZW?trackingTag=github\">Apply here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1p6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c89abebda4bba27b4440a6af54d3a8aedaa89f05/yJafvA6W.png"
    },
    {
        "id": "6309b8c8-a5c0-4b30-a0e2-45e725393423",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6309b8c8-a5c0-4b30-a0e2-45e725393423",
        "created_at": "Tue Sep 17 22:29:24 UTC 2019",
        "company": "Coinbase",
        "company_url": "https://www.coinbase.com/",
        "location": "San Francisco, CA",
        "title": "Android Engineer",
        "description": "<p>Coinbase has moved into a new building (we're leasing the entire building) in the FiDi neighborhood of San Francisco, and are looking to fill the extra space we now have!</p>\n<p>We have multiple Android Engineer openings for different levels.</p>\n<p>Coinbase has a diverse team, a great supportive environment, many different ERGs to support a friendly and welcoming environment for diversity in the workplace. We've been growing rapidly, going from a company of 200 to 700+ people in just a year.</p>\n<p>We’re always excited for new challenges when it comes to architecture and programming. Our code base is 99% in Kotlin and every new feature is preferred to be written using the latest best practices such as repository pattern with Rx and MVVM. Our minSDK is 23 so there's very little legacy-handling BS and because our users can lose money if our app contains bugs, we make sure everything we ship is of the highest quality.</p>\n<p>Our interview process consists:</p>\n<ul>\n<li>Remote coding challenge (data structures and API design) - 1h</li>\n<li>Pre-onsite Team interview with Hiring Manager - 30mins</li>\n<li>On-site interview:</li>\n<li>Pair Programming #1 (1.5h)</li>\n<li>Lunch with the team (30m-1h)</li>\n<li>Pair Programming #2 (1.5h)</li>\n<li>System Design (1h)</li>\n<li>Values Interview (30m)</li>\n</ul>\n<p>We also have multiple iOS, web frontend, backend, crypto, and infra/ops positions.</p>\n<p>Hit us up for referrals or if you have more questions!</p>\n",
        "how_to_apply": "<p>Email your resume and GitHub profile to <a href=\"mailto:wallet.jobs@coinbase.com\">wallet.jobs@coinbase.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEJ5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6d7b18728beea2f4557457615635054ecce7a853/coinbase.png"
    },
    {
        "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
        "created_at": "Sat Aug 03 00:50:23 UTC 2019",
        "company": "Game Closure",
        "company_url": "http://gameclosure.com",
        "location": "San Francisco, Mountain View, Tokyo",
        "title": "Senior Game Engineer",
        "description": "<p>Game Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n<p>Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.</p>\n<p>It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n<p><strong>The Role:</strong></p>\n<ul>\n<li>Be responsible for designing, developing and deploying major game features</li>\n<li>Own game feature areas from end-­to­-end</li>\n<li>Be the champion for the user!</li>\n<li>Insist on the highest standards and create functional and engaging features that will delight our users</li>\n<li>Be part of a tight game development team looking to iterate fast on a fun concept and then building it out</li>\n<li>Have real input on end-user product</li>\n<li>Be a key member of a high performing software engineering team</li>\n<li>Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements</li>\n<li>Hands­ on architect and coder for sophisticated client/server systems for mobile gaming</li>\n<li>Innovate and iterate on process, systems and technology to deliver world­-class social games</li>\n<li>Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!</li>\n</ul>\n<p><strong>Desired Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience, working on cross functional teams.</li>\n<li>Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).</li>\n<li>Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.</li>\n<li>Proficient at using script debuggers like Chrome Debugger.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.</li>\n<li>Solid familiarity with analytics and A/B testing in mobile games</li>\n<li>Familiarity with git, svn or other VCS.</li>\n<li>Self starter, analytical and creative</li>\n<li>Strong team player with a positive attitude.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.</li>\n<li>Check out Everwing on Facebook Instant Games in Messenger. Can you build this game?</li>\n<li>Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).</li>\n</ul>\n<p><strong>Bonus:</strong></p>\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n<li>Expert knowledge of TypeScript</li>\n</ul>\n<p><strong>GC Perks:</strong></p>\n<ul>\n<li>Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered</li>\n<li>Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more</li>\n<li>Commuter Pass + Free Parking: Your commute and parking to the office is on us!</li>\n<li>PTO: Unlimited vacation policy</li>\n<li>Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks</li>\n<li>Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"
    },
    {
        "id": "ccb64440-49fc-480a-a132-854ee99a63c6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ccb64440-49fc-480a-a132-854ee99a63c6",
        "created_at": "Tue Sep 03 17:56:54 UTC 2019",
        "company": "Belong Home",
        "company_url": null,
        "location": "Palo Atlo",
        "title": "Software Engineer / Sr. Software Engineer, Platform",
        "description": "<p>Have you been looking to join an early-stage, silicon valley startup? Are you looking for a fast-paced environment where your voice matters? Then, Belong is for you!</p>\n<p>We are seeking world-class, motivated and passionate individuals for our Platform Engineering team. You will be based in our Palo Alto office working closely with our product team and business stakeholders to build great software. As an early member of this team, you will co-create all the infrastructure and processes with the team. You will take on the challenge of solving complex technical problems to deliver robust, performant, scalable and secure web services. Our core product experiences are written in C# / .NET stack. You should also be comfortable evaluating and exploring new technologies and runtimes.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Collaborate and work with our small knit engineering team in an agile environment delivering secure,\nscalable solutions</li>\n<li>Review code and provide feedback to improve code quality</li>\n<li>Work closely with quality engineers to identify test cases and devise efficient, scalable testing\nprocesses.</li>\n<li>Balance engineering costs of development, testing, deployment complexity, and run-time cost, to\ndeliver optimum value for the business and customers</li>\n<li>Stay current with the latest development best practices and cultivate continuous improvement of\ncoding standards and team processes</li>\n</ul>\n<p>Required Skills / Experience:</p>\n<ul>\n<li>3+ years of experience (or 6+ years for Sr. Software Engineer) building web-based\napplications,REST  APIs using .NET / .NET Core, C# stack</li>\n<li>Experience with writing code for large, high volume web platforms</li>\n<li>Experience with relational database development (preferably SQL Server) from schema design to\nwriting complex, optimized queries</li>\n<li>Experience with distributed version control systems, continuous integration, and continuous\ndeployment systems</li>\n<li>Experience with cloud services (preferably AWS) is a solid plus</li>\n<li>Experience with front-end development (preferably React) is a solid plus</li>\n</ul>\n<p>Interested? Submit your resume to <a href=\"mailto:weinstein.christy@belonghome.com\">weinstein.christy@belonghome.com</a></p>\n<p>About Belong Home:</p>\n<p>We are an experienced team backed by Andreessen Horowitz, GGV Capital, Laurence Tosi and the Uber Syndicate. Fresh off of our Series A round of financing, we are hard at work designing the future at the intersection of consumer real estate and hospitality.</p>\n<p>There is more than one American Dream. Owning your home is one of those dreams. It's been an aspiration for a long time, and we know that millions struggle to achieve it. But there are other American Dreams.</p>\n<p>Some of these dreams are about living differently than previous generations - for whom owning was everything. We may want to use our cash to start a business. We may want to experience new places. We may not have the money yet for home ownership, but still dream of living in a glorious home where we can put down roots and experience the sense of belonging.</p>\n<p>Our Mission</p>\n<p>To foster human connection by deepening our collective sense of belonging. One unique home, one special neighborhood, one new city at a time.</p>\n<p>Our Vision</p>\n<p>There is more than one American Dream.\nOf course, owning your own home is one of those dreams.\nIt’s been an aspiration for a long time, that millions struggle to achieve.\nBut there are other American Dreams many of us are pursuing.\nSome of these dreams are about living our lives in different ways than previous generations - for whom owning was everything.\nWe may want to use the cash we have to start a business.\nWe may want the flexibility to experience new places.\nWe may not have the money yet for home ownership – but still dream of living in a glorious home where we can put down roots and experience the richness of connection to a neighborhood.</p>\n<p>This is a new mindset.</p>\n<p>We are a community of people looking for a dream rental, and people who own properties and are looking for people who will love them. The old-school terms \"landlord\" and \"tenant\" don’t apply in our world. Here, there are people who want to adopt homes for a while, and people who have wonderful residences ready for them.</p>\n<p>Our owners are not giant holding companies that own thousands of homes and view them as pure financial assets. There's a level of mutual respect and caring in our world that simply doesn't exist in the transactional, brutalist world of landlords and tenants.</p>\n<p>We manage properties for our owners, and treat the people who live there with the attention, speed and concern they deserve. And we support those who are living an ownership-free lifestyle by creating a true community everywhere we are. Our residents are connected not only to each other, but also to the local merchants, events, and institutions that give communities their unique character. Before, renters often felt like second-class citizens; with us, they are an immediate and integral part of the community.</p>\n<p>So, whether you own property and you're looking for someone to live in it and love it, or you're looking for a home where you can put down roots – for however long you're planning to be there – we are the answer.</p>\n<p>Renting is the new American lifestyle. We didn’t create it, but we're making it sing.</p>\n",
        "how_to_apply": "<p>Interested? Submit your resume to <a href=\"mailto:weinstein.christy@belonghome.com\">weinstein.christy@belonghome.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2h4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0dcc8fe2af59439923701ab6621c26fe1487e0b8/belong_logo%20(1).png"
    },
    {
        "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
        "created_at": "Mon Nov 19 20:08:09 UTC 2018",
        "company": "Prezi",
        "company_url": "http://prezi.com",
        "location": "San Francisco ",
        "title": "Senior Full Stack Engineer ",
        "description": "<p>Prezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.</p>\n<p>To help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Make significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.</p>\n</li>\n<li>\n<p>Work in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.</p>\n</li>\n<li>\n<p>Work through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).</p>\n</li>\n<li>\n<p>Release early, release often, deploy to production from day one.</p>\n</li>\n<li>\n<p>Work with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.</p>\n</li>\n<li>\n<p>Coordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.</p>\n</li>\n<li>\n<p>Contribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.</p>\n</li>\n<li>\n<p>Participate in hackathons and engineering days</p>\n</li>\n<li>\n<p>Learn from and share your knowledge with your team and colleagues on the go.</p>\n</li>\n</ul>\n<p><strong>Skills and traits we are looking for:</strong></p>\n<ul>\n<li>\n<p>A passion for delivering value to users</p>\n</li>\n<li>\n<p>Excellent communication skills, both verbal and written</p>\n</li>\n<li>\n<p>4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)</p>\n</li>\n<li>\n<p>A solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)</p>\n</li>\n<li>\n<p>Proficiency with servers, linux, cloud infrastructure, build systems, continuous integration</p>\n</li>\n<li>\n<p>A passion for clean, maintainable, well-tested code</p>\n</li>\n<li>\n<p>Experience working with applications at scale</p>\n</li>\n<li>\n<p>The ability to structure and build complex client side applications</p>\n</li>\n<li>\n<p>Knowledge of test automation of backend and frontend applications</p>\n</li>\n<li>\n<p>Extensive knowledge of responsive design, web standards and modern browsers</p>\n</li>\n<li>\n<p>Ability and willingness to learn fast and pick up new things easily</p>\n</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>\n<p>A work environment where people from all backgrounds can thrive and grow</p>\n</li>\n<li>\n<p>People who listen to your opinions and value them</p>\n</li>\n<li>\n<p>The opportunity to spend time working at our Budapest office</p>\n</li>\n<li>\n<p>The opportunity to go to tech conferences anywhere in the world</p>\n</li>\n<li>\n<p>Flexible working hours and untracked vacations</p>\n</li>\n<li>\n<p>Quality meals, snacks, drinks every day</p>\n</li>\n<li>\n<p>A fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.</p>\n</li>\n<li>\n<p>A centrally located office in downtown San Francisco</p>\n</li>\n<li>\n<p>401k plan</p>\n</li>\n<li>\n<p>Health, dental and vision insurance</p>\n</li>\n<li>\n<p>Commuter benefits</p>\n</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/d5687acb1\">https://grnh.se/d5687acb1</a></p>\n",
        "company_logo": null
    },
    {
        "id": "66097d63-4021-4c59-b250-abc44169fb3b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/66097d63-4021-4c59-b250-abc44169fb3b",
        "created_at": "Mon Sep 16 13:59:25 UTC 2019",
        "company": "Rainway, Inc.",
        "company_url": "https://rainway.com",
        "location": "Seattle",
        "title": "Senior C#/.Net Developer",
        "description": "<p>At Rainway, we're building the future of gaming by allowing users to connect, share, and play all their PC games on all their screens. Play the latest and greatest AAA and indie games anywhere, on everything from a Chromebook to your iPhone.</p>\n<p>Rainway is hiring a Senior C# Engineer to help build, maintain, and expand our essential user-facing software. The Rainway Dashboard sits at the center of our service, allowing users to enjoy our low-latency game streaming, all-in-one game launcher, and many other unique features.</p>\n<p><strong>We're looking for someone passionate about software development and building incredible user experiences through elegant code</strong>. Our technologies are truly unique, and you'll be able to work alongside and learn from first-class engineers creating solutions that allow PC games to be played anywhere.</p>\n<h3>You will help us with the following responsibilities:</h3>\n<ul>\n<li>Implementing QOL architectural changes that make it easier to expand the software's core offering.</li>\n<li>Porting code to .NET Core while leveraging modern APIs such as Span, Memory, and Channels for fast networking and native interoperability.</li>\n<li>Identifying and building solutions for unique technical challenges that result in fantastic user experience.</li>\n<li>Listening to user feedback to understand the needs of the broader community.</li>\n<li>Having empathy for issues/friction as to address them through creative engineering that delights our users.</li>\n</ul>\n<h3>What you should have:</h3>\n<ul>\n<li>Strong verbal and written communication skills and clarity in technical communications.</li>\n<li>A strong sense of ownership.</li>\n<li>A desire to learn, experiment, and build solutions to difficult technical challenges.</li>\n<li>Deep knowledge and real-world experience with modern C# application development.</li>\n<li>Experience with multi-threading, asynchronous programming, and native interoperability.</li>\n<li>An understanding of binary data structures and how to work with them.</li>\n</ul>\n<h3>Bonus points:</h3>\n<ul>\n<li>Real-world experience with C/C++ programming.</li>\n<li>A love for PC gaming.</li>\n</ul>\n<h3>Perks:</h3>\n<ul>\n<li>You can be an early employee in a fast-growing startup focused on delivering a unique user experience through a challenging yet fun to build technology.</li>\n<li>Full employee benefits including health, dental and vision.</li>\n<li>You will be eligible to receive stock in the company.</li>\n<li>A large spacious office with amenities to your heart's desire.</li>\n<li>A desk fund that lets you decorate so you can feel at home</li>\n<li>You get to play games at work.</li>\n</ul>\n<p><strong>If you are passionate about this opportunity and ready to help us build the future of gaming, we encourage you to apply today.</strong></p>\n<p>Job Type: Full-time</p>\n<p>Salary: $100,000.00 to $130,000.00 /year</p>\n",
        "how_to_apply": "<p>Email <a href=\"mailto:jobs@rainway.io\">jobs@rainway.io</a> with your resume</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakp5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f0d594c067a675aeb573f04cca848da09add1ca5/Icon.png"
    },
    {
        "id": "2c9f30d4-e77b-11e8-8aab-ce7423d373e0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2c9f30d4-e77b-11e8-8aab-ce7423d373e0",
        "created_at": "Tue Nov 13 19:35:35 UTC 2018",
        "company": "Rational Consulting",
        "company_url": null,
        "location": "Redmond, WA",
        "title": "Software Engineer",
        "description": "<p>Rational Consulting is growing, and we need amazing talent to join our team. If you have an entrepreneurial attitude with a deep spirit of service and killer subject expertise, we want to talk to you. We are always looking for the next great consultant to raise the bar and push Rational Consulting to be better than we were yesterday. Staying hungry, curious, and looking forward to what’s next is part of our DNA.</p>\n<p>Be part of the Mobile First, Cloud First excitement! One of our Microsoft teams is building software and services to enable development of rich enterprise class applications on the Microsoft cloud platform. As part of the unified engineering team, you will have the opportunity to apply quality focused engineering practices to your daily work.</p>\n<p>This team is an exciting and fast evolving engineering team within Microsoft focused on building scalable distributed cloud services for Engineering Systems and for the Product Telemetry.\nWe have an exciting opportunity for you as a Full Stack Engineer to innovate, influence, transform, inspire and grow within our organization and we encourage you to apply to learn more!</p>\n<p>What you will do:</p>\n<p>-You will be using sound engineering practices, tools, and standards.\n-You should be willing to work in a highly collaborative environment.\n-Additionally, you will be part of a fun team with diverse interests and backgrounds in a supportive environment.\n-You will become a productive team member through your knowledge and ability to learn technologies and practices such as C#, X++, HTML5, SQL Azure, Azure Service Fabric, JavaScript, Windows and Azure Frameworks, analytics, PowerApps, Power BI, Common Data Service, design patterns, unit and functional testing, OO design, and more.\n-You will be exposed to a broad range of problems and technologies as we are rapidly evolving our service architecture to leverage Microsoft’s cloud services assets like Azure.\n-Our team works in an agile start-up like environment where we expect each team member to think out of the box to contribute and collaborate towards the mission of the team in a feature-crew setting\n-As part of this team you will get exciting opportunities to work on cutting edge technologies across a variety of platforms to build the next generation application experiences for Microsoft and revolutionize the way businesses operate.</p>\n<p>What you will bring:</p>\n<p>-Experience and ability to work with Microsoft development technologies like .NET and C#\n-5 years or more of HTML, CSS, and JavaScript/TypeScript\n-3 years or more of SQL\n-Experience using GitHub as version control\n-Azure or Cloud experience highly preferred\n-3 years of object-oriented design, database design, algorithms, data structures and parallel programming\n-A minimum of 5 years of industry experience working as a software engineer/developer\n-BA/BS in Computer Science or equivalent.\n-Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check</p>\n<p>Who you are:</p>\n<p>-Proactive. You are always thinking ahead about what is best for the Client\n-Adaptable. Change happens at lightning speed (especially at Rational), you are flexible, enjoy challenge, and get behind new ideas\n-Visionary. Ability to see \"the whole picture\" and simultaneously remain slightly obsessed with the details \n-Collaborative to the Core. Demonstrated ability to work in a team environment, as a leader and member</p>\n<p>Rational Consulting is a results-oriented consultancy designing premium customer experiences. Each of our business practices are deeply rooted in delivering client success. We see ourselves as partners to our clients, and we invest in each of their business goals, ensuring that our work helps deliver on these goals. Client success is our ultimate metric, and what drives our mindset, skillset, and company culture.</p>\n<p>Incredible people are our non-negotiable. Our experienced team of consultants spans the globe. We love what we do, and who we do it with – let’s begin our next chapter together. </p>\n",
        "how_to_apply": "<p>Please send your resume to <a href=\"mailto:katyann@rationalconsulting.com\">katyann@rationalconsulting.com</a></p>\n<p>OR</p>\n<p>apply at: <a href=\"https://boards.greenhouse.io/rationalconsulting/jobs/4104879002\">https://boards.greenhouse.io/rationalconsulting/jobs/4104879002</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmhZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--90d24a725c441581640d041a43afca856a1197e9/RATIONAL%20CONSULTING_FULL_LOGO_BLK.jpg"
    }
]